{
  "name": "Dark Souls Status Effects",
  "author": "Moosh",
  "added": "23 Apr 2022",
  "updated": null,
  "tags": [
    "#Enemy",
    "#Global",
    "#Weapon",
    "#Item",
    "#Combo"
  ],
  "rating": "1",
  "downloads": "19",
  "info": "This script adds the five main status effects from Dark Souls series and includes some companion scripts to go with them. Statuses don't go into effect until a meter is filled up all the way by repeatedly being hit.\n\nThis script uses new 2.55 features so be sure you're on the latest build in order to use it.",
  "description": "This script adds the five main status effects from Dark Souls series and includes some companion scripts to go with them. Statuses don't go into effect until a meter is filled up all the way by repeatedly being hit.Poison: Deals damage over time.Toxic: Also deals damage over time, typically faster, percentage based damage compared to poison.Bleed: On filling inflicts an instant burst of damage.Frost: On filling inflicts an instant burst of damage and also increases damage taken and MP costs.Curse: Instantly kills the player and halves their max HP.\nThis script uses new 2.55 features so be sure you're on the latest build in order to use it.",
  "setup": "Combine the Global Script:\nAs with all global scripts, you'll need to combine this with your own if you already have one. Copy all the parts in the example to where they should go relative to the points in your script: pre-while(true), pre-Waitdraw(), and pre-Waitframe(). Additionally, if you're combining it with my death penalty script, look for this line and uncomment it (remove //):\n\n// DeathPenalty[_DP_HASDIED] = 1;\n\n\nConstants:\nThere's a lot of constants in this one, many of them optional. Here's the critical ones for the script to work:\nC_STATUSBAR_BG: Color for the background on the status meters.C_STATUSBAR_FG: Color for the border of the status metersC_STATUSBAR_TEXTSHADOW: The color blackPOISON_TILE and others: Tiles for the status icons for each status effect.POISON_COLOR1, POISON_COLOR2 and others: Colors used for the status meters for each status effectSFX_POISON and others: Sounds for when inflicted with each status. 0 for no sound.SFX_POISON_TICK and SFX_TOXIC_TICK: Sounds when damaged by poison and toxic. 0 for no sound.\n\nIf you want the curse status to kill the player, you'll also want to set these constants for the special death animation:\nCURSE_ANIM_TILE: First tile in the death animationCURSE_ANIM_W: Tile width of the death animationCURSE_ANIM_H: Tile height of the death animationCURSE_ANIM_FRAMES: Number of frames in the death animationCURSE_ANIM_ASPEED: Duration each animation frames in game time (60ths of a second)\n\nTiles used by this script are expected to use 8-bit color mode. I did this because there's enough constants already.\n\nAssigning the Scripts:\nThis is just a small note because this script uses a lot of sub scripts of different types. In addition to the global script, there's 6 generic scripts, 1 combo script, 1 NPC script, one eweapon script, and one item script. Be sure to assign all of these, especially the generic scripts without which the statuses won't do anything.\n\nInflicting the Statuses:\nIn order to make enemies inflict status, you'll need to use one of two helper NPC scripts: EnemyStatusContact and EWeaponStatusContact. The first makes the enemy inflict status on contact and the second applies status to weapons it fires. Both scripts use the same D0-7 arguments:\nD0: Which status to inflict0 - Poison1 - Toxic2 - Bleed3 - Frost4 - CurseD1: How much of the meter to fill (0-100).D2: How long the status lasts for in frames (60ths of a second). If 0, will use default timings.\n\nIf you're a person of culture and poison swamps are more your thing, there's a combo script for that as well. In the combo editor, give a combo the script PoisonSwamp and set its properties as follows:\n\nAttribytes:Attribytes[0]: The status to inflict. Uses the same values as the previous two scripts.Attribytes[1]: How much of the meter to fill (0-100)Attribytes[2]: How often to apply status buildup in frames (60ths of a second)Attribytes[3]: Set to 1 if the status only builds when Link is walkingAttribytes[4]: Sound to play when the status buildup ticks\nAttrishorts:Attrishorts[0]: How long the status lasts for in frames (60ths of a second). If 0, will use default timings.\nAttributes:Attributes[0]: How much to slow down Link for (no strict limits but 0 to -1 is sensible)Attributes[1]: A combo to draw over Link when in the swamp. Once again using 8-bit color mode.\n\nSetting up Items:\nThere's a few items you can use with this script and all of them are optional. Set these up if you want.\n\nPurging Stone:\nThis is an active item (or a pickup if you're old school) that removes curse status, if you're like me and feel it should be permanent. Just give your item the CurseCure item script, set SFX_CURSE_CURE to the sound to play when you use it, and it should be good.\n\nResistance Rings: \nYou can have up to five rings that protect you against status buildup. They can be individual items or all use the same one. Set these constants to the items you want to use:I_RING_POISONBITE: Ring that protects against poison.I_RING_TOXINBITE: Ring that protects against toxic.I_RING_BLOODBITE: Ring that protects against bleed.I_RING_FROSTBITE: Ring that protects against frost.I_RING_CURSEBITE: Ring that protects against curse.\n\nYou can also adjust the individual strengths of these rings with the constants directly below them.\n\nRusted Iron Ring:\nThis item makes you immune to the speed modification effect on swamp combos. Set I_RUSTEDIRONRING to the item you want to use.\n\n \n\nRequires std.zh and LinkMovement.zh.",
  "has_zip": true,
  "has_popup": true
}