{
  "name": "Power Bracelet (Liftable)",
  "author": "Emily",
  "added": null,
  "updated": "17 Feb 2022",
  "tags": [
    "#2.55",
    "#Weapon",
    "#Item"
  ],
  "rating": "2",
  "downloads": "95",
  "info": "A power bracelet item script that allows you to lift pots/rocks/etc, and throw them.",
  "description": "Spawn items:Either under the object when you lift it, or falls out of it when you break it; configurable per-comboEither from a dropset, or pre-set itemsEither every time, or as a \"Special Item\"; i.e. Heart Piece under a rock. This mode will set Screen->State[ST_SPECIALITEM] when you pick it up, so no other special item can be on the same screen.Hurt enemies:Deal damage with the thrown object; amount configurable per-comboCarry across screen borders (toggle-able per-bracelet item)Carry in water (toggle-able per-bracelet item)Drop what you are holding when hit (toggle-able per-bracelet item)GFX/SFX:Use a \"Weapons/Misc\" sprite upon the object breaking (configurable per-combo)Play an SFX when it breaks (configurable per-combo)Undercombo- either use the screen's undercombo, or use the next combo in the list (toggle-able per combo)Lift from layers (which is TEMPORARY layer alteration; as one would want for this!)\nMinimum ZC version: 2.55 Alpha 40\n\nCredit to ywkls for inspiration/idea (and 'ComboInFront(int dir)'), and to Moosh for 'scrollingDraws.zh', which I modified for this.\nNote: The modified scrollingDraws.zh is no longer present as of V2.1.0. Scrolling draws still work, using 2.55's 'Game->Scrolling[]' system.\nChangelog:\n02-Nov-19 - V1.0.0 uploaded\n03-Nov-19 - V1.0.1 - Lift/Throw SFX (d6/d7) added\n22-Nov-19 - V2.0.0 - Overhaul. Change setup. Add lifting from layers.\n24-May-20 - V2.1.0 - Remove the modified 'scrollingDraws.zh' code, use 'Game->Scrolling[]' from 2.55 instead.\n12-Feb-22 - V2.1.1 - Minor update: Clarify instructions, add Player Tile Modifier option\n\nDISCLAIMER: If you encounter any issues with using this script, PLEASE DO LET ME KNOW SO I CAN FIX IT.",
  "setup": "Only std.zh is required.\n\nCONSTANTS:\nCB_LIFT - the button to use to lift stuff (default CB_A)\nCB_THROW - the button to use to throw stuff (default same as CB_LIFT)\nHELD_DRAW_LAYER - the layer to draw the held object to (default 3)\nWEAPON_DRAW_LAYER - the layer to draw the thrown weapon to (default 3)\nTILE_INVIS - An invisible tile (default 20)\nLW_THROWN - the LW_ type to use for the weapon (default LW_SCRIPT1)\nSHADOW_SPRITE - the Weapons/Misc sprite to use for the shadow (default 50)\nTOP_GRABBABLE_LAYER - the highest layer that combos can be grabbed from\nUSE_PTM - Whether or not to include the Player Tile Modifier in custom player sprites.\n\nITEM:Set the flag \"Constant Script\" (Flag 15)Assign the script to the \"Action\" slotSet up parameters:d0 - the Step of the thrown lweapon (movement speed)d1 - the initial Jump of the thrown lweapon (vertical movement)d2 - Lift Delay (the number of frames it takes to lift an object)d3 - Custom animation:To use no custom animation, set this to 0To set up a custom animation:Create 16 combos in a row.First 4: Up,Down,Left,Right - standing stillSecond 4: Up,Down,Left,Right - walkingThird 4: Up,Down,Left,Right - swimmingFourth 4: Up,Down,Left,Right - LiftingSet d3 to the upper-left combo (up-facing, standing still), and this will be used.UseSound: The value set as the sound will be used for the 'Lift' SFX. The next sound after this (n+1) will be used for the 'Throw' SFX.FlagsFlag 0: Can carry while swimmingFlag 1: Will drop held object if hitFlag 2: Can carry across screens\nNo setup is required for the lweapon script, though make sure it is assigned to a slot!\nFor EACH COMBO:Set up type/flagEITHER set the type to 'Bush->Next', OR set the inherent flag to 'Pot, Liftable (Scripted)', 'Pot, Slash or Lift (Scripted)', or 'Rock, Lift Normal (Scripted) to have the combo be liftable.If you instead set the inherent flag to 'Rock, Lift Heavy (Scripted)', it will only be liftable if the bracelet item has a 'Power' higher than '1'.Set up AttributesAttributes[0] - Weapons/Misc sprite to use on breaking the objectAttributes[1] - Damage done by the thrown objectAttributes[2] - If positive, the item ID to drop when broken. If negative, the item dropset to drop an item from when broken.Attributes[3] - SFX to play when brokenSet up Misc FlagsFlags[5] - If this is checked, the next combo in the list will be used instead of the undercombo. (Bush->Next combotypes always do this)Flags[6] - If this is checked, the item will only be dropped once (as the screen's Special Item).Flags[7] - If this is checked, the item will drop when the object breaks, instead of when you lift it",
  "has_zip": true,
  "has_popup": false
}