{
  "name": "Mani Weapons",
  "author": "Mani Kanina",
  "added": null,
  "updated": "27 Jul 2021",
  "tags": [
    "#FFC",
    "#Weapon",
    "#Item"
  ],
  "rating": null,
  "downloads": "26",
  "info": "A new set of weapons for usage in your ZC quests",
  "description": "This is a collection of weapon scripts that I made for one of my quests but refined to be released for public use. I might expand this later if I ever make any more weapon scripts.\n\nThis collection currently contains:\n\nSword: 180 Degree melee swing in front of you.\nSpear: An 8 directional melee weapon.\nWaveGun: A projectile shooting weapon that moves in a wave pattern.\nYeet: Throw a projectile in a straight line in front of you.\nSmartBomb: A screen nuke option.\nDashAttack: Move in a straight line forwards at greater speed and ram enemies for light damage.\nCrossBow: Rapid fire bow weapon, damage and projectile appearance scales with Arrow item, also has a low damage backup option if you're out of arrows to shoot.\n\nUpdate 2:\nBug fixes and allowing the dash attack to cost maigc to use.\n\nUpdate 1:\nAdded a 180 Degree sword weapon, something I have wanted and I'm sure others too.\n\n---------------------------------\nScripters considerations:\nThe wavegun script is quite FFC heavy and will use one FFC per projectile you shoot and will remain in action till the projectile dies or goes off screen, this can end up using some 4-7 FFCs on the same time.\nSword charging is local to the FFC and will not persist past a given screen. FFC carryover is commented out but can be enabled, is likely not ideal in most quests though given how it eats FFCs by ID.",
  "setup": "Requires import std.zh & ffcscript.zh in order to run.\n\nStep 1:\nThe file contains a few constants you might want to tweak:\nWaveBeamSlot: What FFC script slot the WaveBeamFFC is stored at.\nBlankSprite: This should be a sprite that is blank. You need to set this up manually so the sprite is over empty tiles in the tile page.\nCROSSBOW_BU_SPRITE: Crossbow's sprite that it will use when out of ammo.\nDO_THE_YEET: Use Yeet text on yeet item. Set to 0 to turn off.\nMW_YEET_COMBOS: First of four combos used when Link holds up the yeet item before throwing: (Up, Down, Left, Right)\nWAVEGUN_PROJ: Wavegun projectile sprite The sprite itself should be the last of 3 horizontal tiles, which one is used is random.\nMW_SPINATTACK_SFX: Spin attack SFX for the sword.\nMW_SWORD_CHARGE: Spin attack Charge time for the sword.\n\nStep 2:\nSet up the item scripts FFCWeaponLauncher and FFCWeaponLauncherNoMulti.\nYou need either on or the other on the item you want to run these weapons, the latter prevents you from having multiple instances of it running on the same time. In most scenarios this is the most ideal option and it's recommended you use that first. Multiple FFCs running is not the same thing as multiple projectiles on screen, since the FFCs generally terminate long before the projectile.\n\nStep 3:\nAssign all the FFC scripts to various slots, then write down the slot numbers you put them on, this will be needed later.\n\nStep 4:\nConfigure the items, see further down for appropriate input for each weapon script.\n\n\n\n\nSword:\nD0: Damage\nD1: Sprite used, should be the first of two horizontal tiles pointy end facing right. Tip should be at the very end of the second tile.\nD2: The current item you're configuring's item ID.\nD3: Spin attack enabler, set to a number bigger than 0 if you want the sword to be able to charge.\nD4: Range in abstract. 6-8 is good for single tile sword. 14-16 is good for one and a half tile long swords. Smaller number makes the weapon closer to Link.\nD5: SFX that plays for normal swings.\nD6: Unused.\nD7: FFC slot the weapon script is in.\n\nSpear:\nD0: Damage.\nD1: Sprite used, sprite should be the first of two horizontal tiles and have the pointy end facing right.\nD2: The current item you're configuring's item ID.\nD3: Unused. (has extra code if you want to script your own charge moves, see script file)\nD4: Unused.\nD5: SFX to play when stabbing.\nD6: Unused.\nD7: FFC slot the weapon script is in.\n\nWaveGun:\nD0: Damage.\nD1: Sprite used for the \"gun\". It should be first in a line of four tiles facing four directions: Up, Down, Left, Right.\nD2: The current item you're configuring's item ID..\nD3: Unused.\nD4: Reach, this needs to be set to 1 or the item will look glitchy.\nD5: SFX.\nD6: Unused.\nD7: FFC slot the weapon script is in.\n\nYeet:\nD0: Damage.\nD1: Sprite used.\nD2: The current item you're configuring's item ID..\nD3: Unused.\nD4: Unused.\nD5: SFX.\nD6: Unused.\nD7: FFC slot the weapon script is in.\n\nSmartBomb:\nD0: Damage, both used for the smart damage and the 8 projectiles.\nD1: Sprite used for the projectiles. Tile for the sprite should be the last of three in a row, and it will pick which one it uses randomly.\nD2: The current item you're configuring's item ID..\nD3: Unused.\nD4: Unused.\nD5: Unused.\nD6: SFX.\nD7: FFC slot the weapon script is in.\n\nDashAttack:\nD0: Damage.\nD1: Sprite used for dust cloud.\nD2: The current item you're configuring's item ID..\nD3: SFX. This is on loop every few frames while you run.\nD4: Magic cost to use, if any. (Set to 0 for it to be free).\nD5: Unused.\nD6: Unused.\nD7: FFC slot the weapon script is in.\n\nCrossBow:\nD0: Damage. This is the base damage when you got no Arrow item, a multiplier is applied depending on your Arrow item: Wood: 2x, Silver: 3x, Gold: 4x. If you're out of arrow ammunition you will instead use the base damage / 2.\nD1: Sprite used by the crossbow, it should be the first tile out of four facing: Up, down, left, right.\nD2: The current item you're configuring's item ID..\nD3: Sprite use for the default arrow. This will be overwritten by the regular arrow types sprite if you have an Arrow item.\nD4: Unused.\nD5: SFX used when you have no arrow ammo. In standard cases SFX 1 will be used. (This is the standard arrow shooting SFX).\nD6: Unused.\nD7: FFC slot the weapon script is in.",
  "has_zip": true,
  "has_popup": true
}