{
  "name": "Estus Flask (Souls-like)",
  "author": "Moosh",
  "added": "31 Mar 2019",
  "updated": null,
  "tags": [
    "#Global",
    "#Item"
  ],
  "rating": "1",
  "downloads": "25",
  "info": "Here, take this... An Estus Flask, a Moosh's favorite...",
  "description": "This script adds the Estus Flask from Dark Souls to your quest. It's a multi use potion that holds you in place for a bit before healing you. The script also has support for upgrades that increase the flask's capacity or strength, and bonfires that refill them.",
  "setup": "Combine the example global script with your own and then set up the constants and items as instructed:\n\nEstus Flask:\nCreate an Equipment Item with the active script EstusFlask_Use.\n\nGeneral Settings: ESTUSFLASK_INITIAL_CAPACITY: The starting number of flasks you can carry.ESTUSFLASK_MAX_CAPACITY: The max number of flasks you can carry.ESTUSFLASK_UPGRADE_TIERS: The number of strength upgrade tiers you want. 0 for none.ESTUSFLASK_HEALING: The minimum amount of HP the flask heals. (16 = one heart)ESTUSFLASK_HEALING_MAX: The maxiumum amount of HP the flask heals.ESTUSFLASK_DRINK_TIME: How many frames (60ths of a second) it takes to drink the flaskESTUSFLASK_HEAL_TIME: How many frames it takes to heal youESTUSFLASK_REFILL_ON_F6: If 1, F6/death will refill your flasks same as using a bonfire.ESTUSFLASK_HEALING_IS_PERCENT: If 1, the health healed by the flask is a percentageESTUSFLASK_GETTING_HIT_INTERRUPTS_HEALING: If 1, the healing effect after drinking can be cut short by taking damage.ESTUSFLASK_CAN_DOUBLE_DRINK: If 1, using multiple flasks in a row makes you drink them faster.ESTUSFLASK_CAN_WASTE: If 1, the flask is consumed when you press the button instead of when the drinking animation ends.SFX_ESTUSFLASK_DRINK: The sound that plays when Link drinks from the flask.SFX_ESTUSFLASK_HEAL: The sound that plays when his health starts filling after drinking.CR_ESTUSFLASK_COUNT: The counter for how  many flasks you currently have. Script 3 by default.CR_ESTUSFLASK_UPGRADE: The counter for the current upgrade level of the flask. Script 4 by default.\nGraphics Settings:TIL_ESTUSFLASK_DRINK, CS_ESTUSFLASK_DRINK: The starting tile and cset for the animation of Link drinking from the flask.FRAMES_ESTUSFLASK_DRINK: The total number of frames for the drinking animation.TIL_ESTUSFLASK_ITEM: If you want different graphics for the flask emptying as you drink, set this to the tile for the flask item as seen in the item editor. Otherwise set it to 0.STATES_ESTUSFLASK_ITEM: This is the number of visual states the flask can take including empty and full. These go from empty to full and directly follow TIL_ESTUSFLASK_ITEM in the tile page.SPR_ESTUSFLASK_PARTICLES: If you want particles drawn around Link while healing, set this to the sprite animation in weapons/misc.\n\nFlask Capacity Upgrade:\nCreate a pickup item and give it the pickup script EstusFlask_CapacityUpgrade. Set it's D0 and D1:D0: The string to play when the item is picked up. 0 for none.D1: How much to expand flask capacity by.\nThis script doesn't actually expand how many flasks you can hold at once, rather how many you get back when you use a bonfire or F6. You could potentially give out temporary flasks through other means.\n\nFlask Strength Upgrade:\nCreate a pickup item and give it Increase Amount of 1 and Increase Counter Max and But Not Above to the value of ESTUSFLASK_UPGRADE_TIERS. Set Counter Reference to the counter CR_ESTUSFLASK_UPGRADE is set to. This one doesn't need a script.\n\nBonfire FFC Script:\nPlace an FFC with this script over a bonfire or other object you want to replenish flasks with. The following constants will affect the behavior of the bonfire:ESTUSFLASK_BONFIRE_HEALS: If 1, using the bonfire fully heals Link.ESTUSFLASK_BONFIRE_RESETENEMIES: If 1, using the bonfire will attempt to respawn all enemies in the quest. It won't work for ones on the same screen as the bonfire until you leave and probably ones on the same screen as a warp exit. ZC's spawn system is a nightmare.ESTUSFLASK_BONFIRE_SETS_CONTINUE: If 1, using a bonfire will set the continue point to that screen.ESTUSFLASK_BONFIRE_OVERRIDES_CONTINUE: If 1, bonfire continue points will attempt to override every other continue point in the quest. Check this if you want to only use bonfires to update the continue point.LAYER_APROMPT, CMB_APROMPT, CS_APROMPT: Layer, combo, and cset for a button prompt when next to the bonfire.\n\nThis script uses std.zh.",
  "has_zip": true,
  "has_popup": true
}