{
  "name": "[Autoghost] Ice Lynel",
  "author": "Orithan",
  "added": "17 Dec 2015",
  "updated": null,
  "tags": [
    "#Enemy",
    "#FFC"
  ],
  "rating": "1",
  "downloads": "41",
  "info": "I present to you: The Ice Lynel.Ice Lynels are an upgraded, Autoghosted, version of the Blue Lynel that gradually grows layers of ice over it that protect it from damage, potentially up to the point of near-invulnerability and it increases the power of it's sword beams. They are very dangerous in groups and especially so if you don't put much offensive pressure on them.",
  "description": "Returning from Enemy of the Month, Ice Lynels are an upgraded, Autoghosted, version of the Blue Lynel that gradually grows layers of ice over it that protect it from damage and increase the power of it's sword beams. These layers of ice break when they are hit by attacks and the layers do not protect against all forms of damage. Very dangerous in groups and are very difficult to kill if you don't hit them constantly. They also become invulnerable to all weapons except what the layers of ice don't protect against when they have 3 or more layers.\nSince the contest, the script has been rewritten and polished to iron out the kinks in it and anyone who is currently using the EotM iteration is urged to download this script and update any enemies that use it. It is also possible to create non-L\n\nThis script uses all 12 misc variables enemies have. The script also has preset defaults for some of its misc variables, which are set by default if you leave variables that have them as 0.\n\nCredits:Lejes - For being a big help with fixing up bugs within the script.Saffith - For creating Ghost.zh and help with fixing bugs.Moosh - For giving feedback.Eddy & Daviawesome - Prompting me to create the enemy for Enemy of the Monthywkls - For prompting me to rewrite and submit this script to the database through his usage in Passage Through Time.ZC Devs - For ZCNintendo - For creating the Legend of Zelda.",
  "setup": "Requires Std.zh (included within your ZC folder), String.zh (included within your ZC folder) and Ghost.zh.\n\nHow to set the script up:\n\n1) Make or rip the tiles that the Lynel and the ice layer will use. The Lynel itself uses 4 combos for the sprite itself: facing Up, Down, Left and Right in this order. The ice layer uses up to as many tiles as you want the Lynel to have ice layers, each additional ice layer coming right after each other in the tile page.\n\n2) Import Ghost.zh, std.zh and string.zh and set up the global script to run autoghosted enemies if you already haven't. The instructions on how to set up Ghost.zh and Autoghost is included in the text files packaged inside the Ghost.zh folder and in this video Saffith set up on Autoghost.\n\n3) Compile the script.\n\n4) Adjust the enemy's stats and misc attributes as necessary:\n\nSet up HP, Damage, Weapon Damage, Weapon, Step speed, Random Rate, Halt Rate and Homing Factor as usual.\n\nMisc Attribute #:\n\n- 1: The velocity of the sword beam, in pixels per second, being fired at the player. Defaults to 300, which is 3 pixels per frame.\n\n- 2: The SFX played when Ice Lynel puts up an ice layer. Defaults to 44, which is the default Ice SFX\n\n- 3: The amount of damage each Ice Layer adds to the Lynel's beam attack, in quarter hearts. Defaults to 4, which is 1 Heart\n\n- 4: The number of ice layers the Lynel can get. Defaults to 2.\n\n- 5: The delay between each time the Lynel gains an ice layer. Defaults to 120, which is 2 seconds.\n\n- 6: The number of hits it takes to remove each layer. Defaults to 2.\n\n- 7: The number of layers the Ice Lynel starts off with. Defaults to 0.\n\n- 8: The flags determining what defenses the ice layer does not defend against. By default, the ice layer does not protect against Bombs, Super Bombs, Fires, Reflected Fireballs and Script LWeapons. Look up the Misc Attr Flags and std_constant.zh for more details of which flags correspond to which defense.\n\n- 9: The base tile for the ice layer. Set this to the tile of the first ice layer.\n\n- 10: The CSet for the ice layer. Default to 7.\n\n- 11: The starting combo the Lynel uses. Must be the combo that corresponds to its up-facing sprites. This is an Autoghost requirement.\n\n- 12: The number of the FFC script the Lynel uses. This is also an Autoghost requirement.\n\n5) Enjoy",
  "has_zip": true,
  "has_popup": true
}