{
  "name": "Moosh's NPC Script",
  "author": "Moosh",
  "added": null,
  "updated": "02 Dec 2021",
  "tags": [
    "#FFC"
  ],
  "rating": "20",
  "downloads": "390",
  "info": "I made this script as an alternative to an older script by Lemmy Koopa. The script lets you have NPCs that you can talk to as well as NPCs that block your path and appear and disappear depending on what items you have. It also did away with a pretty serious bug that allowed sequence breaking.\n\nUpdate: Added simplified version of the script and an example add-on script for trade sequences.",
  "description": "This script was only inspired by Lemmy's version and doesn't have all the features his did. To help you decide which one to use, here's a list of features exclusive to each:\n\nFeatures exclusive to Lemmy's script:NPCs can be placed off the 16*16 pixel grid and function fineYou can make any FFC solid (Although this doesn't mean you can't break through them)NPCs have a nifty overhead effect when you walk behind themNPCs can move about and still be solid\nFeatures exclusive to my script:You can have NPCs appear based on items as well as disappearYou can have NPCs run scripts when you talk to themYou can have an icon appear above Link's head when you can talk to an NPCYou can safely use guard NPCs to block off areas\nUpdate 3/23/2015:\nI've hopefully fixed a bug that caused ZC to crash sporadically upon entering the screen. If you still experience crashing after updating the script or any other odd behavior, please send me a PM.\n\nUpdate 2/26/16:\nI've added a small fix to prevent screens that share the same layer screen from carrying over solidity from NPCs onto other screens. Since this could potentially break some people's setups, there's a constant to turn it on or off.\n\nUpdate 1/13/18: \nAdded a an argument for FFC script calls on the more complex version of the script and the option to wait for called FFC scripts to finish before resuming.\n\nUpdate 3/12/19:\nAdded an exception for the DialogueBranch addon even if NPCSCRIPT_WAITS_UNTIL_SCRIPTS_FINISH is turned off. Added a setting to prevent ItemCheck NPCs from disappearing immediately if you get an item on the same screen.\n\nUpdate 12/1/21: \nRearranged some stuff in the script. Added checks for Link's current action, as well as better compatibility with flippers and roc's feather.\nUpdate 12/1/21: Rearranged some stuff in the script. Added checks for Link's current action, as well as better compatibility with flippers and roc's feather.",
  "setup": "Settings Constants:RESET_NPC_LAYER_ON_ENTRY: If set to 1, the script will reset NPC solidity when entering a screen. This fixes screens that share layer screens.NPCSCRIPT_ITEMCHECK_ONLY_UPDATES_ON_SCREEN_ENTRY: If set to 1, NPCs that disappear when Link collects an item on the same screen won't disappear until you scroll off the screen.NPCSCRIPT_WAITS_UNTIL_SCRIPTS_FINISH: If set to 1, FFC scripts run by the NPC script will interrupt the NPC script running until they finish. This prevents talking to the NPC while these scripts are running.\nFull NPCScript:\nThis is the original full NPC script with all the fancy features.\n\nConstants:\nSet LAYER_NPC to 1 or 2 depending on which layer you want to use for NPC solidity. (Or you can use -1 to use it like an old fashioned NPC script where you set the solidity yourself)\n\nSet CMB_NPC_HIDDEN to an invisible combo with no solidity.\n\nSet CMB_NPC_SOLID to an invisible combo that's fully solid\n\nSet LAYER_NPC_CANTALK, CMB_NPC_CANTALK, and CS_NPC_CANTALK to the layer, combo, and CSet the speech icon should appear in.\n\nPlacement:\nPlace FFCs on the 16*16 pixel grid. You can select View->Show Grid or press the ~ key to make the grid visible.\n\nBe sure that you have the Run Script at Screen Init FFC flag checked and the Messages Freeze All Action and Messages Disappear quest rules checked.\n\nFFC Arguments:D0: Set this to the string that should play when you talk to the NPC.D1: Set this to the item that makes the NPC disappear. Make the number negative to make the NPC appear when you have the item instead.D2: Set this to the type of NPC it will be:0 - None - Does nothing special1 - Face Link - Faces Link when you get close (the FFC's combo should be the first of four facing: Up, Down, Left, Right)2 - Guard H - Follows Link on the X-Axis3 - Guard V - Follows Link on the Y-AxisD3: Argument 1 for the NPC's movement type:None - Does nothingFace Link - Default direction the NPC should face (You can set this to 4 to give it a custom default state)Guard H - Min X position in tilesGuard V - Min Y position in tilesD4: Argument 2 for the NPC's movement type:None - Does nothingFace Link - Distance in pixels at which the NPC will turn to face LinkGuard H - Max X position in tilesGuard V - Max Y position in tilesD5: Set this to 1 if you don't want the NPC to be solid.D6: Set this to a number greater than 0 to call that script when you talk to the NPCD7: Argument D0 for the FFC script called by D6\nNPCScript_Simple:\nThis is a simplified version of the original script with the extra stuff stripped off. It doesn't do automatic solidity, moving NPCs or appearing/disappearing NPCs, but it's more flexible for attaching scripts to because it can pass all its extra arguments to them.\n\nConstants:\nSet LAYER_NPC_CANTALK, CMB_NPC_CANTALK, and CS_NPC_CANTALK to the layer, combo, and CSet the speech icon should appear in.\n\nPlacement:\nPlace FFCs on the 16*16 pixel grid. You can select View->Show Grid or press the ~ key to make the grid visible. Since this version doesn't have the automatic solidity, you'll have to place down solid combos under it yourself.\n\nFFC Arguments:D0: Set this to the string that should play when you talk to the NPC.D1: Set this to a number greater than 0 to call that script when you talk to the NPC.D2-D7: If you call a script with D1, these work as that script's D0-D5.\nTradeSequence:\nThis is an example of an add-on script that can be called by the simplified NPC script. It makes an NPC that takes one of your items, gives you a new one with a hold up animation, and remembers that you've traded with it.\n\nConstants:\nSet D_TRADE to an unused Screen->D value 0-7 if you have other scripts using Screen->D.\n\nSetup:\nInstead of being placed on the screen as an FFC, this script is called by another FFC using the NPCScript_Simple script. Set D1 on that FFC to this script's slot and D2-D6 to this script's D0-D4.\n\nFFC Arguments:D0: The item ID of the item to check for in the trade.D1: The item ID of the item to give in the tradeD2: The string that plays when the player doesn't have the required itemD3: The string that plays when the player has the required itemD4: The string that plays when the player talks to the NPC again after making the trade\nThis script uses ffcscript.zh in addition to std.zh.",
  "has_zip": true,
  "has_popup": true
}