{
  "name": "Cutscene Trigger",
  "author": "Moosh",
  "added": "15 May 2018",
  "updated": null,
  "tags": [
    "#FFC"
  ],
  "rating": "4",
  "downloads": "49",
  "info": "This script is meant to be used alongside non-scripted cutscenes to smooth over the entrance into them and hopefully make setting up one time events a little simpler. The cutscenes themselves you'll still have to make, of course.",
  "description": "This script is meant to be used alongside non-scripted cutscenes to smooth over the entrance into them and hopefully make setting up one time events a little simpler. The cutscenes themselves you'll still have to make, of course. \n\nFeatures of the script:Multiple one time trigger cutscenes on a single screenCutscenes that trigger if Link has an itemCutscenes that trigger based on screen secrets or other things that change a combo flagWalking Link to where he'll be at the start of the cutsceneA debug setting that draws cutscene trigger hitboxes to the screen\nI've also included some small FFC scripts that I found helpful in making cutscenes for the test quest.\n\nUpdate 3/23/22: Fixed an oversight where the hitbox for entering the screen on top of a trigger was active even when the trigger itself wasn't. Also added a couple more settings to address some additional limitations.",
  "setup": "First, set D_CUTSCENETRIGGER to a Screen->D that's not being used by other scripts, at least not global or commonly used ones. If you have no scripts using Screen->D you can leave it at 0.\n\nPlace your FFC with the CutsceneTrigger script where you want your cutscene trigger to be. The position of the FFC represents the top-left corner of the trigger hitbox.\n\nSet the FFC's D0-7 arguments as follows:D0: Which DMap to warp to for the cutsceneD1: Which screen to warp to for the cutscene. Please Note: Give your screen number in decimal. ZQuest numbers screens in hexadecimal, but the FFC editor only accepts decimal, so you've gotta convert.D2: The width of the trigger hitbox in pixelsD3: The height of the trigger hitbox in pixelsD4: Set to a number 1-17 to make the cutscene only play once. Once Link is warped off the screen, that numbered cutscene is flagged as having played. If set to 0, the cutscene will always play.D5: If this is positive, the trigger will check for that number flag under Link. If negative, it will check if Link has that item ID. If 0, Link can always trigger the cutscene.If it's positive and you add 1000 to the flag, it will trigger when that flag is on the screen (on layer 0) at all, rather than just under LinkIf it's negative and you subtract 1000 from the item ID, it will trigger if Link doesn't have that item IDD6: The X position Link will walk to before warping. If D6 and D7 are both 0, Link is warped immediately.D7: The Y position Link will walk to before warping.A. Delay: Setting the FFC's A. Delay to >0 will allow the script to trigger even if you enter the screen on top of its hitbox, without needing to walk off first.\nSome extra tips:You'll probably want to set the constant CUTSCENETRIGGER_SHOW_HITBOXES to 1 while testing the triggers, to be sure you got the size and position of the hitbox right.Argument D5 can be used to disable cutscenes with secrets the same as it can be used to enable them.If your cutscene gives out an item or some other form of critical progress, you should either give them out at the very beginning of the cutscene or use some way besides argument D4 to disable it. Cutscenes using argument D4 are flagged as viewed as soon as Link warps, meaning they can be skipped with F6.To prevent infinite loops, cutscenes won't trigger if Link enters the screen directly on top of them. Offset edge of screen triggers in a bit so Link doesn't harmlessly walk over them, or use A. Delay to disable this behavior.You can have triggers for the same cutscene overlapping or adjacent to each other to make unusual trigger regions. I'd avoid doing this for two different cutscenes, though.\nRequires std.zh.",
  "has_zip": true,
  "has_popup": true
}