{
  "name": "Crystal Switch and Colored (Red/Blue) Barriers",
  "author": "Moosh",
  "added": null,
  "updated": "07 Mar 2019",
  "tags": [
    "#FFC",
    "#Global"
  ],
  "rating": "4",
  "downloads": "69",
  "info": "Notice: If you're still using 2.50.2 the script won't compile right due to a bug. Use the latest version, folks.\n\nI know there's a few of these scripts floating around, but I looked at what was there and wasn't really a fan. (Combo cycling? Eww!) Here's my own take at it with some extra bells and whistles included.",
  "description": "Notice: If you're still using 2.50.2 the script won't compile right due to a bug. Use the latest version, folks.\n\nI know there's a few of these scripts floating around, but I looked at what was there and wasn't really a fan. (Using combo cycling? Eww!) Here's my own take at it with some extra bells and whistles included.\n\nFeatures:The ability to walk on top of and jump off of barriers that are raised underneath Link.Up to 8 different colors of barriers per dungeon.New Crystal Switch behaviors, affecting up to four barriers at a time.An extra set of combos that can be triggered to raise via screen secrets.\nUpdate 3/6/19: Added a setting that raises Link with the blocks. Fixed a couple small bugs.\nUpdate 1/13/20: Added an option to the switch script to use custom combos.",
  "setup": "Constants:\nSet these constants in the script file. Ordered from most to least important:\nCritical:\nThe script needs these constants assigned to work with your quest.CMB_CRYSTALSWITCH_BLOCKS: The first of the combos for the raising blocks. Up to 8 groups of combos in all depending on the number of color states you're using. Goes in the order of [Lowered Combo] - [Raising Animation Combos] - [Raised Combo]. See the example combo page.CMB_CRYSTALSWITCH_TRIGGERS: The first of the combos for the crystal switches. Up to 9 groups of combos in pairs of two: active, then inactive. The first pair is a generic color used for certain cases. See the example combo page.CMB_CRYSTALSWITCH_STATICBLOCKS: The first of the combos for an extra raising block type. This is triggered by secrets.\nOptional: \nThese are settings that can further customize the script for your quest:CRYSTALSWITCH_CAN_WALK_ON_TOP: If 1, Link can walk on top of crystal switches and their solidity is handled by the script. Else they're whatever solidity you give them.CRYSTALSWITCH_RESET_ON_F6: If 1, the script will reset switch states to their defaults every time you F6. Otherwise it will remember them and only assign them when you first load the save.CRYSTALSWITCH_USE_BLANK_TRIGGER: If 1, some cases where switches represent multiple colors will use color neutral tiles instead of defaulting to one of the selected colors.CRYSTALSWITCH_USE_FFC_GRAPHICS: If 1, the CrystalSwitch script will use the FFC's graphics for the switch and not the combo under it. Helpful if you want to layer your switches over things, but you'll have to set solidity under the FFC yourself.CRYSTALSWITCH_RAISELINK: If >0, Link will rise that many pixels with the blocks.CRYSTALSWITCH_NUM_COLORS: The max number of switch colors [2-8]. You can reduce it if you don't plan to use all 8 colors and want less combo setup.CRYSTALSWITCH_RISINGCOMBOS: The number of combos in the block's rising animation. You can raise or lower this to make the transition animation as smooth or abrupt as you want.CRYSTALSWITCH_RISINGASPEED: The number of frames each step of the animation takes.SFX_CRYSTALSWITCH_TRIGGER: The sound when the Crystal Switch trigger is hit.\nDungeon Init States:\nThis step is optional. If you don't set these in the script, all dungeons will default to all barriers alternating between raised and lowered to start with.\n\nIn the script find, this section. You can Ctrl+F the %FINDME to jump to it quickly.\n\n\t//%FINDME CrystalSwitch Init States\n\t//Define special starting states for the levels in your quest here.\n\t//True = Raised. False = Lowered.\n\t//                 ss, Level, Color1, Color2, Color3, Color4, Color5, Color6, Color7, Color8\n\t//CS_StartingState(ss, 1,     true,   false,  true,   true,   false,  true,   true,   true);\n\nUnder the example function CS_StartingState(), you can paste similar copies of that function to assign the starting state of all blocks in a dungeon.\n\nThe arguments (stuff that goes between the commas) of the function go as follows:[Argument 1] - ss - This is just something that goes at the start of every instance of the function.[Argument 2] - Level Number - This is the level number for the dungeon from the DMap editor.[Argument 3-10] - Color States - These are the color states for the dungeon. True means the block will start raised and False means it will start lower. You don't need to include all 8 of these, once you've set all the states you'll be using you can close the function off early.\nCombine Global Script:\nThis script is a global script, so you'll have to combine it (CrystalSwitch_Example) with your existing script if you're using more than one in your quest. If you don't know how to do this manually I've made a tool that semi-automates the process.\n\nCrystalSwitch_Trigger FFC Script:\nPlace an FFC with this script anywhere you want a Crystal Switch on your screen. It should be aligned with the combo grid (X and Y divisible by 16). Graphics on the FFC are optional. Set the FFC Flag Run Script At Screen Init.\n\nThe FFC's script arguments go as follows:D0-D3: Switch colors [1-8] to toggle with the switch. 0 for none.D6: If >0, forces the switch to use custom combos. The first of the two is the lowered block state, followed by the raised one. Unlike the default combos, this has no context for more complex interactions with >2 colors and merely references the current state of the first color of block in the set.D7: A special argument that affects the behavior of the switch:0 - D0-D3 toggle on/off.1 - D0 lowers, all others raise.2 - Cycles one lowered color between D0-D3. All the others raise.\nThis script requires std.zh.",
  "has_zip": true,
  "has_popup": true
}