{
  "name": "Mario-styled Card minigame",
  "author": "Alucard648",
  "added": "08 Apr 2022",
  "updated": null,
  "tags": [
    "#FFC"
  ],
  "rating": "1",
  "downloads": "4",
  "info": "Made on request by SkyFlare",
  "description": "Mario-styled card minigame. Stand on FFC and press Ex1 to pay initial cost. The cards are shuffled.Stand on card and press EX1 to flip it over. If 2 of the same kind drawn, an effect resolves. Most cards add counters, some have special effects. Some cards are labeled as Whammies, which, if flipped over, end the game.",
  "setup": "1/Set up PAIRLUCK_DECKSIZE combos for different card effects 0 - card back 1 - blank 2 - Arrows + 50% max 3 - Bombs + 50% max 4 - Super Bomb +1 5 - HP + 50% max 6 - MP + 50% max 7 - Doubles next reward or penalty 8 - +50 rupees 9 - Triggers screen secrets10 - Awards Link item (not affected by x2 bonus)11 - Lightning strikes Link for damage12 - Enemies spawned13-15 - general purpose (scripts). In the demo, 14 is a pit that sends Link into instant death spikes.16-25 - script counters(1-10) + 50%+max26-31  - general purpose (scripts). In the demo, 14 is a pit that sends Link into instant death spikes.2.Assign CF_PAIRLUCK_WHAMMY inherent flag to certain combos3.Place combos from step 1, forming the grid and deck of all possible outcomes in the game. Make sure, that prize cards come in pairs in the table. If you use combos like pitfalls, block off play area with CMB_PAIRLUCK_BARRIER combos to prevent accident falls.4.Place FFC with card back combo and script assigned D0 - #####.____ - string to display at introduction. D0 - _____.#### - string to display when the game is started. D1 - game cost, in rupees. D2 - damage dealt by lightning (card#11) D3 - ID of item to reward (card#10) D4 - Number of enemies to spawn (card#12) D5 - ID of enemies to spawn(card#12) D6 - combo position to render HUD for minigame D7 - #####.____ - string to display at ending the game via max win. D7 - _____.#### - string to display at ending the game via Whammy.",
  "has_zip": true,
  "has_popup": true
}