{
  "name": "Advanced Floor Switches Pack",
  "author": "Moosh",
  "added": null,
  "updated": "20 Sep 2020",
  "tags": [
    "#FFC"
  ],
  "rating": "5",
  "downloads": "165",
  "info": "This is a group of FFC scripts that adds various kinds of switches. Switches will react to Link stepping on them or blocks being pushed over them. Some can be placed off the tile grid as FFCs.",
  "description": "Update 4/30/18: Finally added pressure switches that don't react to Link, so you can create block puzzles without an isolated switch to confirm the solution. I don't know why this wasn't in from the start.\nUpdate 7/5/20: Fixed a bug with SFX on remote switches being backwards from everything else. Also added a 2.55 version that allows for remote secrets on layers.\nUpdate 8/13/20: Switch default SFX setting is reversed again due to a bug. Sorry for the inconvenience.  Also fixed a bug discovered by Deathrider where ID based Switch_HitAll on a screen with secrets would get partially triggered by the secret.\nUpdate 9/20/20: Added the ability to hide some kinds of switches under other combos.\n\nThe types of switches included:\n\nSecret Switch:\nTriggers secrets when stepped on. Can be permanent or temporary. Multiple switches with different IDs can be used to save a permanent tiered secret.\n\nRemote Switch:\nTriggers pseudeosecrets on a remote section of the screen. Secrets can be reset when pressure is released or be permanent.\n\nHit All Switch:\nMakes all combos of a certain ID on a screen behave as switches that must all be hit to trigger a secret. Can trigger normal or remote screen secrets. Can be pressure triggered or permanent.\n\nTrap Switch:\nDrops enemies from the ceiling when stepped on.\n\nSequential Switch:\nA puzzle where a group of switches need to be stepped on in a certain order to trigger a secret.",
  "setup": "Constants for the SFX used by all scripts are at the top of the file. For all of these FFC scripts you'll want to check Run Script at Screen Init on the FFC so it runs before screen scrolling.\n\nSome concepts shared by multiple scripts that you should be aware of:\n\nScreen->D:\nScreen->D is a set of 8 numbers unique to each screen of each DMap that are only used by scripts. This script uses portions of these numbers with a bit (huehuehue) of math to record which switches are pressed on which screens.\nSwitch ID:\nThis is a number between 1 and 128 that's assigned to a switch for keeping track of whether or not that switch has been triggered when re-entering the screen. ID 0 is for a temporary switch or a permanent switch using the screen's ST_SECRET state. Switch IDs are all combined together in groups of 16 into the 8 Screen->D values for the screen they're on. 1-16 go to D[0], 17-32 to D[1], ect. If another script is using Screen->D, use a switch ID that won't be within the same range to avoid conflict. If you're not using other scripts that reference Screen->D on screens with buttons, just remember to give each button a unique ID.\n\nRemote Secret:\nSome scripts will use scripted secrets to trigger events on a certain section of the screen. For these you specify a flag that's placed over those regions and when the secret is triggered, all combos in that region will be set to the next combo in the list, similar to how a lock block works. The flag used should be one without any properties, such as the script flags. You can also use 16-31 if there isn't a secret trigger on the screen.\n\nNow onto the setup of the scripts themselves:\n\nSwitch_Secret\nFor this script, the FFC should have the combo for the unpressed switch. When the switch is stepped on, it will cycle to the next combo in the list, the pressed switch.\n\nArguments:D0: Set to 1 to make the secret permanentD1: Set to the switch's ID if the secret is tiered, 0 otherwise.D2: If > 0, specifies a special secret sound. -1 for default, 0 for silent.\nSwitch_Remote\nFor this script, the FFC should have the combo for the unpressed switch. When the switch is stepped on, it will cycle to the next combo in the list, the pressed switch.\n\nArguments:D0: Set to 1 to make the switch a pressure switch (a block or Link must stay on it to keep it triggered). Set to 2 to make it a pressure switch that only reacts to push blocks.D1: Set to the switch's ID. 0 if the secret is temporary or the switch is pressure triggered.D2: Set to the flag that specifies the region for the remote secret.D3: If > 0, specifies a special secret sound. -1 for default, 0 for silent.D4 (2.55 version only): Specifies the layer for the remote secret.\nSwitch_HitAll\nFor this script, all switches in the same group should share the same combo and be placed on layer 0. It should be the combo for the switch when it hasn't been pressed. When pressed, the combo will be set to the next in the list. Unlike the others, the FFC running this script is not one of the switches and should be invisible. You only need one FFC per set of switches.\n\nArguments:D0: Set this to the combo number used for the unpressed switches.D1: Set to 1 to make the switch a pressure switch (a block or Link must stay on it to keep it triggered). Set to 2 to make it a pressure switch that only reacts to push blocks.D2: Set to 1 to make the secret that's triggered permanent.D3: Set to the controller's ID. Set to 0 if the switch is temporary or you're using screen secrets.D4: Set to the flag that specifies the region for the remote secret. If you're using screen secrets instead of remote ones, this can be ignored.D5: If > 0, specifies a special secret sound. -1 for default, 0 for silent.D6: If you want the script to remember which switches were pressed after leaving the screen, set to the starting ID for the group of switches. This will reference this ID as well as the next n-1 ID's after that where n is the number of switches in the group. Be careful to thoroughly test that this doesn't bleed into other switch ID's or Screen->D used by other scripts. If you don't want to save the switches' states or the switches are pressure switches, this should be 0.D7 (2.55 version only): Specifies the layer for the remote secret. Switch combos themselves must still be placed on layer 0.\nSwitch_Trap\nFor this script, the FFC should have the combo for the unpressed switch. When the switch is stepped on, it will cycle to the next combo in the list, the pressed switch.\n\nArguments:D0: Set to the ID of the enemy to drop inD1: Set to the number of enemies to drop\nSwitch_Sequential\nFor this script, all switches should be the first of a pair of combos, the unpressed switch. Switches should all be placed on layer 0. Each switch should have a unique combo number. The order the switches have to be pressed goes by order of combo number, so the lower numbered switches in the order should have a lower combo number. Unlike the others, the FFC running this script is not one of the switches and should be invisible. You only need one FFC per set of switches.\n\nArguments:D0: Set this to the flag marking all the switches on the screen. The order the switches have to be hit in will be determined by their combo numbers.D1: Set to 1 to make the secret that's triggered permanent.D2: If > 0, specifies a special secret sound. -1 for default, 0 for silent.\nHidden Switches:\nFor Secret, Remote, and Trap switches, you can hide them under combos by enabling the \"Only Visible to Lens of Truth\" flag. This will make the switch invisible (set to SWITCH_INVISIBLE_COMBO) until the combo underneath it matches the combo on the FFC, at which point the FFC will become visible and active. This doesn't work on Hit All or Sequential switches. \n\nAll scripts in this pack require std.zh.",
  "has_zip": true,
  "has_popup": false
}