{
  "name": "Larger Push Blocks",
  "author": "Moosh",
  "added": "29 Aug 2021",
  "updated": null,
  "tags": [
    "#FFC"
  ],
  "rating": null,
  "downloads": null,
  "info": "This script adds larger push blocks made up of multiple combos, up to 4x4 in size. They can be arranged in rectangular blocks or user defined into odd shapes like Tetris pieces. They can do a lot of things ZC push blocks can do, but some of the potential engine interactions are pretty buggy. Be sure to test thoroughly.",
  "description": "This script adds larger push blocks made up of multiple combos, up to 4x4 in size. They can be arranged in rectangular blocks or user defined into odd shapes like Tetris pieces. They can do a lot of things ZC push blocks can do, but some of the potential engine interactions are pretty buggy. Be sure to test thoroughly.",
  "setup": "Solid FFCs:\nThis script requires another script of mine in order to function. Be sure to set up the solid FFCs global script first.\n\nConstants:\nThese are some settings to change how the blocks behave:SCRIPTEDPUSHBLOCK_DELAY: The number of frames you have to push against the block before it moves.SCRIPTEDPUSHBLOCK_PUSHSPEED: How fast the block moves after pushing. Probably shouldn't be much slower than 1.5, else Link could outrun it and possibly do buggy shenanigans.SCRIPTEDPUSHBLOCK_STOP_ON_TRIGGER: If set to 1, the blocks will lock into place after overlapping a group of block trigger flags like engine push blocks do. Every combo of the block must be on a flag for this to happen. Otherwise the blocks won't lock in and secrets triggered by them can be triggered multiple times by pushing them off and on again.\nLargePushBlock\nThis script is used for push blocks that take a regular rectangular shape. Place the script on an invisible FFC in the upper left corner of the block.D0: The width in tiles for the push block. This will use the combos on the screen placed under the FFC.D1: The height in tiles for the push block.D4: Set to 1 if the push block is a one time push.D5: Set to the sum of the following flags to enable pushing in certain directions. If 0, it will default to all directions.1: Up2: Down4: Left5: RightD6: The push level of the block. This has no support for the single use bracelet or any custom level bracelets.0: None1: L2 Push2: L3 PushD7: A custom SFX to play if the block triggers a secret. 0 for default\nOddlyShapedPushBlock\nThis script is used for push blocks that take non standard shapes. They can have holes in them without dragging around the combos in the gaps. Place the script on an invisible FFC in the upper left corner of the block.\nD0-D3 affect the shape of the block row by row, top to bottom. They take numbers 0000-1111 with 1's representing the combos relative to the FFC to use and 0's representing the gaps. So for example, a flipped L Tetris block would look like:\nD0: 1100\nD1: 0100\nD2: 0100\nD3: 0000\n\nThe editor won't save leading 0's after you hit OK, but it's just the numbers that matter.D4: Set to 1 if the push block is a one time push.D5: Set to the sum of the following flags to enable pushing in certain directions. If 0, it will default to all directions.1: Up2: Down4: Left5: RightD6: The push level of the block. This has no support for the single use bracelet or any custom level bracelets.0: None1: L2 Push2: L3 PushD7: A custom SFX to play if the block triggers a secret. 0 for default\nThis script requires std.zh, LinkMovement.zh, and SolidFFCs.zh.",
  "has_zip": false,
  "has_popup": true
}