{
  "name": "Z4 Continue Point & Perpetual Title Screen",
  "author": "Lemmy Koopa",
  "added": "26 Apr 2014",
  "updated": null,
  "tags": [
    "#FFC",
    "#Global",
    "#Item"
  ],
  "rating": "1",
  "downloads": "72",
  "info": "A script for Link's Awakening style continue points and title screens.",
  "description": "The script allows you to have continue points like in Link's Awakening, where whenever you enter or exit a doorway, that is where you'll continue after you die or restart after save. This can be very useful if it's a more appropriate continue point approach than the default continue system in Zelda Classic.You can also set your continue point on demand via script, or disable a doorway continue from being set by the script via FFC.This also allows you to always have a Title Screen pop up everytime you continue your quest. The titlescreen will be basically used as a HUB for transporting you to the continue point, or transporting you to the start of the quest if you made a new quest.",
  "setup": "Setup is relatively easy. Save the code to a .z file and import all the scripts (Slot 2, Slot 3, FFC scripts and item script).After that, designate a Dmap for your titlescreen. Get the number of the dmap and change\"const int titledmap=0;\" to the number of the dmap you've chosen. Make sure to not use that Dmap for anything else.Also change \"const int titledscreen=0;\" to the screen number you'll use for the titlescreen.I highly suggest using Screen 00After that, make your titlescreen. Check the following in the screenflags of your titlescreen:Invisible LinkNo SubscreenSave Point->Continue HereContinue HereMake Link's arrival square or warp A in the middle of the screen.After that, set Side Warp A to the desired beginning screen of your quest. This will make you warp to the beginning of your quest if you don't have a continue point from starting a new game.Now for the Dmap of your titlescreen, check \"Continue Here\", and make sure that every other single Dmap that you use does not have that checked.Your quest should now be able to use the Continue Script just fine now. Now for extra functions:If you want to disable the script from setting your continue point at a certain door, place an FFC over that door with the script \"nocontinue\" selected.If you want to make a script set the continue point on demand, simply enter \"setcontinue=true\" in your script, and it'll set your continue point. There is a demonstration item in the demo and script that sets your point if you want to use that as a reference.",
  "has_zip": true,
  "has_popup": true
}