{
  "name": "Ice Physics [2.53][2.55]",
  "author": "Emily",
  "added": null,
  "updated": "31 May 2021",
  "tags": [
    "#2.55",
    "#Global"
  ],
  "rating": null,
  "downloads": "75",
  "info": "Ice Physics: Both slippery ice, and ice where you slide until you hit something uncontrollably (like in Pokemon).",
  "description": "Ice Physics!Slippery Ice: You set the acceleration, deceleration, and max speed, as well as the combo type, in a function call when merging the global script.An itemclass is specified for \"Traction Boots\". A level 2 of this item will halve the acceleration, and double the deceleration, making ice less slippery. A level 3 will disable this ice entirely. (Level 1 does nothing, in case you want to combine the 2 types of ice in interesting ways; though that will still likely require some modification on your end)Force-Slide Ice: You set the movement speed, which is constant, the combo type, as well as the gridlock setting, in a function call when merging the global script.GRID_NONE = you will just slide where you were. (This setting does not work that well if Diagonal Movement is on!)GRID_HALF = When you begin sliding, you will be locked to the nearest half-tile.GRID_FULL = When you begin sliding, you will be locked to the nearest full-tile.An itemclass is specified for \"Traction Boots\". Any item of this itemclass will disable this ice entirely.Using both types together will require extensive modification for the 2.53 version; far less so for the 2.55 version, because of namespaces.Using either on their own should work out-of-the-box for either version.CHANGELOG:Oct 13, 2019 - Slippery Ice only - Fix a large issue when max speed is set to negative (Max speed <= 0 will now skip the script)Nov 11, 2019 (V1.1) - Both types - Fix hookshot not being accounted for. Now, while hookshotting, the ice will no longer attempt to move you.",
  "setup": "Headers: \"LinkMovement.zh\"Combine the global script with your existing global script; the example can be used on it's own if you have no global to combine it with.Set the parameters for the function call `setIcePhysics'. The parameters vary by version and ice type; you can find them in whicheverscript you are using by doing a 'Ctrl+F' in the script file for \"void setIcePhysics\".",
  "has_zip": true,
  "has_popup": false
}