{
  "name": "SwitchShot / SwitchHook (Oracle of Ages)",
  "author": "Timelord",
  "added": null,
  "updated": "06 Jul 2016",
  "tags": [
    "#FFC",
    "#Item"
  ],
  "rating": "1",
  "downloads": "54",
  "info": "This script replicates the 'SwitchHook', or 'SwitchShot' from 'Oracle of Ages'. I do not recall if it was in any other games.",
  "description": "One of the items intended for the Gamneboy/LA header, the SwitchHook, or SwitchShot acts similar tot he ordinary hookshot, save that instead of dragging Link to a target, it swaps Link and the target. it is designed to work on combos, and enemies, all configurable with a host of settings, including operable layers, npc definitions, and the like.You can easily configure with what enemies Link may swap, using ordinary enemy editor selections.Once configured, you need only create a hookshot item, and apply the SwitchHook item script to it, for it to function.",
  "setup": "Requires: std,zh, ffcscript.zh,\n\nSet-Up\n\nConfiguration Settings\nOrdinarily, you may use the default settings included with the file, however, sould you wish to modify anything, you may do so by changing the values applied to the constants defined as setting values. Boolean settings are off if set to '0', and on if set to '1' or any non-zero value.\n\nMSG_SWITCHSHOT_PICKUP\nThe default ID of a Screen_>Message to display when the user picks up the switchshot item. If set to '0', no message will appear.\n\nSWITCHHOOK_USE_LAYER_0\nSWITCHHOOK_USE_LAYER_1\nSWITCHHOOK_USE_LAYER_2\nEnable the layers on which you wish to allow the switchhook to swap Link with combos, by setting any combination of these to '1'.\n\nSWITCHHOOK_ENEMIES_REQUIRE_SPECIAL_DEFS\nLeave this set to '1', to use enemy editor defence properties to control what npcs are affected.\n\nSUPPORT_GHOSTED_ENEMIES\nIf you use ghost.zh, this should be set to '1'.\n\n__GHI_GHZH_DATA_INDEX\nThis must match the value of  __GHI_GHZH_DATA ; this is usually 15.\n\nSWITCHHOOK_SUPPORT_NORMAL_FFCS\nSet to '1' to allow swapping with an ffc in general (not ghosted enemies)\n\nCF_SWITCHHOOK\nSet this to the ID of the combo flag that you wish to use to indicate a valid switchhook target.\n\nSFX_SWITCHHOOK\nSet this to the sound effect that you wish to use when Link is swapped with any target (combo, ffc, npc, ghosted enemy).\n\nCMB_SWITCHHOOK_UNDERCOMBO_D_LAYER_*\nCMB_SWITCHHOOK_UNDERCOMBO_S_LAYER_*\nCMB_SWITCHHOOK_UNDERCOMBO_C_LAYER_*\n\nDefault undercombo ComboD, ComboS, and ComboC (combo ID, combo solidity, combo CSet) used for layers 0, 1, and 2. Set as desired.\n\nNPCDT_SWITCHHOOK\nThe NPD Defence type default used if no special type is defined int he item editor arguments.\n\n\nCompiling\nBe sure that you import std.zh, and ffcscript.zh, and include this script in your buffer, or otherwise import it.\nCompile.\nAssign the ffc script 'SwitchHook' to an ffc script slot.\nAssign both item scripts, 'SwitchHookItem' and 'PickupSwitchShot' to item script slots.\n\nItem ConfigurationCreate a new item, and name it SwitchHook, SwitchShot, or whatever you fancy.Set its pick-up script to 'PickupSwitchShot'Set its action script to 'SwitchHookItem'Configure the item arguments as follows:\nD0: Message, if you wish to use something other than the default defined by MSG_SWITCHSHOT_PICKUP.\nD1: The Combo Inherent Flag for the Switchshot combos. Defaults to CF_SWITCHSHOT if set to '0'.\nD2: The sound to play when switching. Defaults to SFX_SWITCHSHOT if set to '0'.\nD3: The NPCDT used to define switchshot specific enemies, or enemies affected by the switchshot's moving power. Default value: 12.\nNote: This is only used if SWITCHHOOK_ENEMIES_REQUIRE_SPECIAL_DEFS is enabled.\n\nEnemy Configuration\nIf SWITCHHOOK_ENEMIES_REQUIRE_SPECIAL_DEFS is enabled:\nSet the npc defence 'Hookshot' to 'Ignore if < 1', or whatever value you configured as the required defence, if you changed the default.",
  "has_zip": true,
  "has_popup": true
}