{
  "name": "Authentic dungeon barriers",
  "author": "HuggetSukker",
  "added": null,
  "updated": "16 Jul 2014",
  "tags": [
    "#FFC",
    "#Global"
  ],
  "rating": "4",
  "downloads": "160",
  "info": "Raised and lowered barriers that swap state when Link hits switches, made to emulate the crystal switch barriers in many 2D Zelda dungeons.",
  "description": "After correct setup, this script enables dungeon barriers on any screen. The only per-screen setup you need is to place barrier and switch combos where you want them. When a switch is hit by one of Link's weapons, the barrier state of the entire dmap is toggled. The script can keep track of barrier state for all your dmaps. Lastly, Link can also walk on top of raised barriers if he finds himself standing on a lowered one as they are raised.Update: The script has been improved.-> Added raise and lower animations to barriers-> Fixed an issue with screen transitions, so the combos now change immediatelyUpdate 2:-> Now the barriers have two colors",
  "setup": "1) Create combosCreate a whopping 12 combos:-> Blue and red raised barriers (solid)-> Blue and red lowered barriers (walkable)-> Blue and red raise barrier animations (cycle to raised barriers)-> Blue and red lower barrier animatinos (cycle to lowered barriers)-> Blue and red walkable raised barriers (type: No Ground Enemies)-> Blue and red crystal switches (solid)2) Create a new enemy that will act as a hit detection dummy for barrier switches-> Type: Other-> Leave all stats (except HP > 0)-> Hit sound: Any sound you would like played when a switch is hit-> Misc flags: \"Is invisible\", \"Doesn't count as beatable enemy\"-> Misc flag: \"Damaged by power 0 weapons\" (if you want boomerangs to work)-> Fire Defense: Ignore (unless you want fire to work)3) Change constant values in the script.-> At \"const int SCRIPT_BARRIERS = 1\" change 1 to the number of a slot that you will load the Barriers ffc script into.-> Set the 12 combo constants to your combo numbers4) Usage:Place blue switches, blue raised barriers and red lowered ones wherever you want them. If you want the barrier state of a dungeon to be opposite from start, you have to use a script to set barriers[int dmap] variable or call ToggleBarriers() or ToggleBarriers(int dmap).",
  "has_zip": true,
  "has_popup": true
}