{
  "name": "One-Way Walk Combos",
  "author": "justin",
  "added": "16 Jan 2015",
  "updated": null,
  "tags": [
    "#FFC"
  ],
  "rating": null,
  "downloads": "29",
  "info": "Combo that allows Link to only walk in one direction through it. With a separate combo that can change the direction of the one-way combos.Great for puzzles and mazes.",
  "description": "Place the FFC_OneWay onto a solid combo. The FFC will allow Link to walk through the solid combo only in that direction.Use FFC_OneWayChanger script to change the direction of specific OneWay combos or all OneWay combos on screen.  Use FFC_OneWaySameChanger to change all OneWays facing a certain direction.Changer can set specific new direction- cycle through next or previous direction (order Up, Down. Left, Right)- set to opposite direction- set to random direction- reset to original directionChanged OneWay directions can be saved for screen changes.Thanks to MoscowModder for catching a bug before it was even released, and inadvertently making me add some more stuff and resubmitting.",
  "setup": "Only std.zh is required.1. Create one-way tile for each direction (up, down, left, right) - rotate tile feature is helpful. Create solid combos using these tiles (can be animated). Order your combos - Up, Down, Left, Right. Set the ONEWAY_UP constant in the script file to your Up combo.2. Set FFC_MISC_ONEWAY to a value 0-15, that is not used by other scripts (other FFC->Misc[] ) values or constants3. Import the script, and assign the three FFC scripts to slots.4. Place the FFC_OneWay script on the screen on your OneWay solid combos, set the FFC combo to an invisible combo not Combo0.  Set D0 to 1 if you want any changes in the OneWay combo's direction to be saved for screen changes.5. Don't worry too much about lining up the FFC perfectly, the script snaps it to the grid. But this means if you are slightly left or up of the combo you intend that it'll be on the left or above combo.Note about screen edges.  The OneWay can be placed on a screen edge to scroll offscreen. But with \"Smart Screen Scrolling\" rule off you can scroll back onto the screen unaffected by the OneWay combo.  \"Smart Screen Scrolling\" rule on will prevent scrolling onto the screen because the OneWay combo is a solid combo. Impossible to check for OneWay combo on adjacent screen, so you can't scroll left onto a OneWay Left.If using the FFC_OneWayChanger as well... can be whatever combo you want, or blank (not Combo0) if placing it over a \"step-like\" combo on screen. Stepping on it does the change.D0 = FFC# that it is changing. If you set it to a number not running the FFC_OneWay script it won't do anything. Leave D0 at zero, if you want the changer to change all OneWays on screen.D1 = the new direction for the OneWay. Or -1 for next direction. -2 for previous direction. -3 for opposite direction. -4 for random direction. -5 no directionD2 = reset. Stepping once on the changer sets the new direction. Stepping again resets to original screen direction  ? 0 = no, 1 = yesNote about reset:  it resets to the original direction screen when you came on screen.  not to the previous direction.  if using save on FFC_OneWay, it will be the saved value.FFC_OneWaySameChanger - as above except the D values are...D0 = the direction that will be changed.  all OneWay's currently this direction will be changed to...D1 = the new direction.  same values as with D1 for FFC_OneWayChangerThere is no reset feature on this function.",
  "has_zip": true,
  "has_popup": true
}