{
  "name": "OOT/Majora's Ocarina",
  "author": "Emily",
  "added": "31 Jul 2018",
  "updated": null,
  "tags": [
    "#FFC",
    "#Global",
    "#Item",
    "#Misc"
  ],
  "rating": "1",
  "downloads": null,
  "info": "Implements the Ocarina from OOT and Majora's Mask.CURRENT VERSION: 1.2",
  "description": "NOTE: The Test Quest is too large to upload to PureZC. It is available HERE. It uses version 1.1, which is now outdated, though it should still work as an example quest to show you how mostly everything works. The only difference is that instead of setting an SFX id for a SONGSOUND_ variable you are setting a MIDI id for a SONGMIDI_ variable.\nUse an item with the Ocarina item script to enter \"Playing Mode\", wherein A, Down, Right, Left, and Up become music note buttons. Pressing B, playing a valid song, or reaching 8 notes without a valid song will all exit playing mode. While playing, Link is invincible.\n\nSFX will be played when the notes are played, and unique MIDI will be played for each song- you must include your own SFX/MIDIs for this. By default, the notes use SFX 200-204. Songs have no default MIDI number, you must set them. The Scarecrow's Song does not play a MIDI as it is configured by the player, and as such you cannot know what notes it would use.\n\nIncludes a script for learning songs, a script for having songs activate secrets, a script allowing the player to create their own Scarecrow's song as you would in the original games, a sample global script which should work fine out of the box if you don't need to combine it with another, and the Ocarina item script.\n\nThis script will have the functionality of playing songs to trigger secrets without any modification, though it is set up to be easily modified to do extra things when you play a song. For example, if you are using a Day/Night cycle script, maybe the Sun's Song or Song of Double Time could change the Day/Night state or something such as that. You can customize it however you want, limited only by how well you can script the functionality you want to add.\n\nCHANGELOG:\nv1.1 - Added text when you learn a song, fixed several very specific bugs. Added Test Quest file.\nv1.2 - Changed songs from using SFX to using MIDIs, because 43GB quest files aren't fun.",
  "setup": "Step 1: Change the constant values to your settings. The constants that must be changed can be easily found with CTRL+F \"//CHANGE//\", though a list of these values is:\n\nNOTECOMBO_A, NOTECOMBO_DOWN, NOTECOMBO_RIGHT, NOTECOMBO_LEFT, NOTECOMBO_UP:\nA combo to be displayed during ocarina playing to indicate the given note having been played.\nThe combo will be displayed near the top-middle of the screen on Layer 6. No layer screen setting is required.\nNOTECSET_A, NOTECSET_DOWN, NOTECSET_RIGHT, NOTECSET_LEFT, NOTECSET_UP:\nThe CSet to display the corresponding NOTECOMBO in.\nNOTESOUND_A, NOTESOUND_DOWN, NOTESOUND_RIGHT, NOTESOUND_LEFT, NOTESOUND_UP:\nThese may be left at their default values of 195-199, or changed to whichever SFX id you want to play when the given note is played.\nSFX_ERROR:\nAn SFX to be played if there is an error (Trying to make the scarecrow's song identical to an existing song, or playing an invalid song)\nSONGMIDI_ constants:\nA MIDI id for each song. If you do not intend the player to learn a given song, the ID may be set to 0. Otherwise, set this to the MIDI id of the song.\nThere is a section marked with //CHANGE// which asks how many frames your midi takes to play. For songs which you do not have a MIDI set for, leaving this at the default 20 is fine. If you set a MIDI, you MUST set this value properly- setting this too low will cause your MIDI to be cut off, setting it too long will make the player stuck standing still in silence after the MIDI is over.\nStep 2: Add custom songs (Optional, requires scripting knowledge)-\nFor this, you want to CTRL+F \"//CUSTOMSONG//\" and duplicate whichever part of the code is needed for a song there. Mostly, you will just be creating an extra SONG_, SONGSOUND_, and SONGNOTES_ variable, and then copying a bit of code and switching the existing variables to the one you created.\n\nStep 3: Add song functionality (Optional, requires scripting knowledge)\nBy default you can set it up so that songs can trigger secrets. If you want them to do anything else, you need to script it yourself. In the activateSong() method, there are various lines which begin with \"//INSERT CODE//\". Put whatever code you want to run when the song activates here. You can use this to tie into a custom external script, or do pretty much anything, given that you have the scripting know-how.\n\nThese are all the steps before compiling the quest into ZQuest.\n\nQUEST SETUP STEPS:\n\nImport the 3 FFC Scripts, 1 item script, and the global script.\n\nCreate a custom item of a custom item class, and attach the item script Ocarina.\n\nAdd the FFC script LearnASong to a screen. Give the song id you want it to teach Link as the first parameter. The song ids are the SONG_ constants. This FFC should be visible, perhaps looking like a music sheet or somesuch. It does not need to be, but it should- it will become invisible once Link knows the song it teaches.\n\nAdd the FFC script MakeScarecrowsSong IF you wish to use the scarecrow's song. Link must stand on the FFC and play a song of his choice, which will become the scarecrows song. This song may not be identical to another existing song, and must be 8 notes in length.\n\nAdd the FFC script SongTriggersSecrets anywhere you want playing a song to trigger secrets. The first parameter is the Song id from the SONG_ constants. The second parameter should be 1 for the secrets to be permanent or 0 for them to be temporary. The third parameter should be 1 to require Link to stand on the FFC when playing the song or 0 for Link to be able to play it anywhere on screen.\n\nAnd finally, if you custom-added any song functionality, do whatever you need to do to set that up... I can't exactly give instructions because that would be part of your own addon to this script.",
  "has_zip": false,
  "has_popup": true
}