{
  "name": "GB / LttP-style Treasure Chest",
  "author": "Nimono",
  "added": null,
  "updated": "20 Aug 2016",
  "tags": [
    "#FFC"
  ],
  "rating": "4",
  "downloads": "97",
  "info": "This script lets you create treasure chests you open by pressing A that show you the contents within rising out.",
  "description": "Have you always been annoyed at how ZC's built-in treasure chest combos open by being walked into instead of having to press A to open them? Be annoyed no longer! With this script, you can make treasure chests that work like in LttP* and the GB Zeldas, where you can open them by pressing A, whereupon the contents rise up out of the chest!** Simple to set up! Easy to use! Fun for all the little Gels and Zols!Thanks to Lejes, ywkls, and the others at the Scripting skype group for helpin me out with figuring out some of these things! Also thanks to Lunaria for supplying the 3 lines of code that allow the script to use the secret item of the room.V1.1 update - Freezes the screen after being reminded that feature actually exists, then also added some commented-out code to allow ghost.zh enemies to freeze as well.V1.2 update - Now supports Keys, Level Keys, and Boss Keys! Still have to change the combo type, though. V1.21 update - GHOST.ZH FEATURE ACTUALLY WORKS NOW, THANK YOU YWKLS FOR POINTING OUT THAT I WAS GIVEN THE WRONG CODE TO USE!!!V1.3 update - Now features the ability to have up to 16 chests per screen, with FFCs 17-32 being a mirror of the first 16, allowing you to make rooms where you must decide between treasures! Also allows you to use the Secret Item room type to determine a single chest's contents, if you leave itemID as 0. Code thanks to Lunaria!*Note: Only works with 1x1 chests right now. 2x2 chests are not supported, unfortunately.**This feature is optional! A setting for each FFC allows you to make it NOT rise up out of the chest, and instead be held above the head!",
  "setup": "std.zh is required for this script, please do not forget to import it! Also, if you're using ghost.zh, uncomment the two lines of code about it, SuspendGhostZHScripts() and ResumeGhostZHScripts().Setup is very simple! First, go to your screen and decide where you want your chest. Set it up like you would any other chest, but here's the important part: DO NOT SET THE COMBO TO TREASURE CHEST! It is unnecessary for this script! Once your chest is set up, go to the FFC you wish to use for this script and set it on top of the chest (or where it'll be)- make sure the FFC's CSet is the same as the chest's CSet! Next, set up the D Attributes for it:D0 is the combo number for the closed chest. This value is needed to keep track of whether or not the chest is even there!D1 and D2 are the SFX you wish to use for opening the chest and receiving the item within. Feel free to have either be 0 if you wish- obtaining the item within has its own SFX, so please keep that in mind!D3 is the ID of the item you wish the player to have. You can check it in the Items menu!D4 is the message to display when the item is collected, if you wish to have one. Set it to 0 if you don't!D5 is whether or not to display the item rising out of the chest. If you don't, set it to 0! If you do, any other value will work!Lastly, D6 is what type of chest you wish to use. 0 is a normal, standard chest. 1 gets you a locked chest that requires a key to open. 2 is for chests that require boss keys to unlock.Finally, if you're using any scripts that utilize Screen->D, make sure they don't conflict with the value used by this script- change \"const int DValue\" to something else if it does.Now your chest should be working just fine!",
  "has_zip": true,
  "has_popup": true
}