{
  "name": "Prism Elemental",
  "author": "Orithan",
  "added": "29 Jul 2019",
  "updated": null,
  "tags": [
    "#Enemy",
    "#FFC"
  ],
  "rating": null,
  "downloads": "12",
  "info": "Another enemy returning from Enemy of the Month; Prism Elementals are gimmicky enemies that carry the attributes of the Prism combos in ZC. Shoot magic and (optionally) sword beams through to split them!The demo file has Keese and Wizzrobe enemies which carry the same attributes to show how it can be applied to other enemies.This supports versions 2.50.2 and up. The script and the demo file has been compiled in 2.53, but it should be perfectly compatible with 2.50.2.",
  "description": "This is an autoghosted enemy that, like its namesake, acts like the Magic Prism combos you place down in ZQuest. When magic (and optionally) sword beams hit the enemy, they get split off. These enemies are gimmicky, but they can be useful in puzzle scenarios or to spice up enemy encounters. This script runs on built-in enemy types and thus can be given to a variety of enemies to make them more interesting. Maybe you can have a Wizzrobe floating around with this? Maybe you can have a Keese flying around the screen, splitting magic blasts?\n\nCaveats:\nDue to the way the script works, any enemies running this script will have their Magic and Reflected Magic (and Sword Beam and Reflected Beam if the appropriate setting is checked) defenses set to Ignore after the first frame they run the script. Keep this in mind when designing and placing down the enemy. On the flip side, these defenses act as extra variables to record on initiation and use for other features (of which the Magic defense is in use).",
  "setup": "Requires Std.zh (included within your ZC folder), String.zh (included within your ZC folder) and Ghost.zh (included within your ZC folder with versions 2.53 and newer).\n\nSetting up:Make or rip the tiles that the Prism Elemental use.Import Ghost.zh, std.zh and string.zh and set up the global script to run autoghosted enemies if you already haven't. The instructions on how to set up Ghost.zh and Autoghost is included in the text files packaged inside the Ghost.zh folder and in this video Saffith set up on Autoghost.Compile the script. There are a couple of utility functions located at the bottom of the script file that I may reuse in other scripts. Include these only once in your file.Set up the enemy in the enemy editor as you would a regular enemy (mostly. There are some things you need to set listed below).Enjoy!\nAttributes:\nAll attributes are set as they would be on a regular enemy.\nMisc. Attr. 11: Set this to -1. This is an Autoghost requirement.\nMisc. Attr. 12: The number of the FFC script the Prism Elemental uses. This is also an Autoghost requirement, which is waived if the appropriate settings are set in your Ghost.zh file.\n\nSpecial settings:\nMagic Defense: Set this to determine which type of prism it is.\n(None): 3-Way Prism\n1/2 Damage: 4-Way Prism",
  "has_zip": true,
  "has_popup": true
}