{
  "name": "FFC Shop",
  "author": "Emily",
  "added": null,
  "updated": "15 Aug 2022",
  "tags": [
    "#FFC"
  ],
  "rating": "1",
  "downloads": "63",
  "info": "Tango-based FFC shop, with price display, and buy confirmation menu.",
  "description": "Requires 'SimpleTangoHandler' script to run.Will display the item being sold, along with the price. (The price display can be toggled off per-FFC)Can be set to only allow buying of an item if the player does not already have that item.Compatible with Moosh's EmptyBottles script.Changelog:Version 1.0 - A version for 2.53+.Version 1.01 - Update 2.53+ version; now works properly for non-combogrid-aligned FFCs, includes a constant for setting the layer of the price text; includes 2 parameters for Y-Offsets (one for the item/sold out visual, and one for the price text); includes a parameter for shopIndex, so that the script can tell shops apart from each other; added default functionality for a shopSpecial value of 2 - \"Only purchasable once\". When buying such an item, neither that item nor any other item with the same shopIndex value (also with shopSpecial set to 2) will be able to be purchased again. Useful for one-time only items that are NOT equipment items (use shopSpecial of 1 for equipment items, as it will allow you to repurchase it if you lose the item)Version 1.02 - Update 2.53+ version; fix the item offset being doubled accidentally.Version 1.03 - Add 2.55 VersionVersion 2.0 - Now works with engine bottles instead of Moosh's bottle script",
  "setup": "Requires: 'SimpleTangoHandler', tango.zhPlace an FFC with this script for each item you want to be sold.-Walking up to the FFC and pressing A will bring up a tango dialogue asking if the player wants to buy the item or not-Saying yes will charge the player, and give them the item-Saying no, trying to press A without enough money, or (if using Moosh's EmptyBottles compatibility) trying to buy a bottleable item without an empty bottle, will all display (separate, configurable) messages.InitD setup in readme file",
  "has_zip": true,
  "has_popup": false
}