{
  "name": "Red/Blue Crystal Switch (2.50.2/2.55)",
  "author": "Emily",
  "added": null,
  "updated": "31 May 2021",
  "tags": [
    "#FFC",
    "#Global"
  ],
  "rating": "1",
  "downloads": "66",
  "info": "Allows creating Red/Blue blocks with a Crystal Switch to toggle them! Script files included for 2.50.2 and 2.55The 2.50.2 version should work in 2.55, but the 2.55 version is BETTER- it runs faster, and in some areas requires less manual configuration.",
  "description": "Have you ever wanted a simple-to-set-up Red & Blue Blocks Script? Here it is!Version 1.0 (October 13th, 2018) - Initial ReleaseVersion 1.1 (June 20th, 2019) - Some improvements to the 2.55 script, with new 2.55 features.",
  "setup": "Headers required: Only std.zhTo set up:1. Create the CombosYou are going to want to create 12 combos for this script. You want to set their combo ID's to the constants at the top of the script- the constants listed (in parentheses)You will want a purely solid combo, of each color. (COMBO_REDUP, COMBO_BLUEUP)You will want a purely walkable combo, of each color. (COMBO_REDOWN, COMBO_BLUEDOWN)You will want a solid combo with an animation, of each color, transitioning from the solid one you created to the walkable one you created. This should combo cycle to the walkable one of the same color. (COMBO_RED_GOINGDOWN, COMBO_BLUE_GOINGDOWN)You will want a solid combo with an animation, of each color, transitioning from the walkable one you created to the solid one you created. This should combo cycle to the solid one of the same color. (COMBO_RED_GOINGUP, COMBO_BLUE_GOINGUP)You will want a walkable combo of each color, which looks exactly the same as the SOLID combo, with the inherent flag \"No Ground Enemies\". \"No Enemies\" also works, though this will stop flying enemies from being able to hit Link if he walks on top of them. (COMBO_REDUP_WALKABLE, COMBO_BLUEUP_WALKABLE)You will want a \"Crystal Switch\" of each color. The actual combo properties do not matter; only that the tile looks correct. (COMBO_REDSWITCH, COMBO_BLUESWITCH)2. You will want to choose your settings.Set to 1 for yes, 0 for no:DEFAULT_RED_UP - Red is the one which starts as up.SEPARATE_PER_LEVEL - Keep track of the switch states separately for each \"level\" - this is the DMap's \"Level\" number. Different DMaps of the same level will still share states (i.e. for multi-floor dungeons)CAN_WALK_ON_TOP - Link can walk on top of these, if he is on top of them when the switch is toggled. (If another script forces him onto them, it will also allow walking then)3. MAX_LEVEL_USEDThis should be set to the highest DMap Level number you will use. If it is bigger, it won't break anything; if it is too small, it WILL break things.If you are using the 2.50.2 script, you must also place the SAME number here: `bool redIsUp[#]` instead of the #. In the 2.55 version, you do not need to do this.4. LWeapon BlacklistThis is a list of weapon types which will NOT trigger crystal switches. It is set up to be fairly good by default, but if you want to change this for your quest, by all means.5. Import ScriptsMerge global scripts if you need to. You will need to set the \"active\" script to global Slot 2, and set the FFC script to an ffc slot.6. Build your screen!Build a screen using these. You will want to use RED_UP/RED_DOWN/BLUE_UP/BLUE_DOWN (the first 4 combos) for placing the blocks. It doesn't really matter if you place only ups or only downs or a mix of both, the script will figure out what to do either way.Crystal Switch: You want to place an FFC (with a SOLID COMBO underneath it) wherever you want your crystal switch. Set the FFC to use the script `crystalSwitch`, and make sure that the flag `Run Script On Screen Init` is CHECKED. You will most likely also want the Animation quest rule \"FFC's are visible while the screen is scrolling\" checked, or the switch will be invisible while scrolling. Make sure that the FFC's combo is set to any non-0 combo. You can probably set it to one of the colored switch combos, though it doesn't REALLY matter- the script will set the combo regardless.//That's all, folks!",
  "has_zip": true,
  "has_popup": false
}