{
  "name": "Custom Combo SFX, Animations, and Dropsets",
  "author": "Moosh",
  "added": null,
  "updated": "11 Jul 2019",
  "tags": [
    "#FFC",
    "#Global"
  ],
  "rating": "2",
  "downloads": "56",
  "info": "A script for giving slash combos (and other combos) special SFX, animations, dropsets, or a combination of the three.",
  "description": "A script for giving slash combos (and other combos) special SFX, animations, dropsets, or a combination of the three.\n\nUpdate 10/18/17: Turns out removing a pointless line without compiling is a bad idea. Because that pointless thing might be what's holding up a bunch of leftover junk code. \nUpdate 11/7/18: Added compatibility with regrowing slashables, the ability for combos to drop items, and the ability to play the animation every time a combo changes.\nUpdate 11/7/18 again: Two updates in one day! This time I've addressed people's complaints and added an experimental global script that should set up the FFCs automatically.\nUpdate 7/11/19: Added compatibility for push blocks, like if you want to have a pot that can be pushed, now it won't trigger the shatter animation or sound. Unfortunately scripts that change the combo like the power bracelet still won't be compatible...",
  "setup": "Place an invisible ComboSFXAnim ffc on the screen and set its arguments as follows:D0: The combo ID to check for. When any combo with this ID switches to a different one, the sound and animation will play. If D0 is negative, the animation will play every time the combo changes. Else it will only play when it switches off the specified combo ID.D1: The SFX to playD2: The type of animation:0: No animation1: Sprite Animation - Creates a sprite from weapons/misc over the combo.2: ZC Bush Animation - Draws tiles loosely replicating the bush animation other slash combos use3: Spreading Particles - Sends particles in a 360 degree spread outwards4: Aimed Particles - Sends particles in a 40 degree spread away from Link's positionD3: GFX for the animation. If this is a sprite, it's an ID from weapons/misc. Otherwise it's a tile. Bushes use four 8x8 pixel centered tiles, see the example image for how this translates from ZC's minitile setup.D4: The CSet to use. If the GFX are a sprite, you can actually change it's CSet here by setting it >0, else it will use the default.D5: Number of frames in the animation. Doesn't work for bush or sprite animations.D6: Animation frames (60ths of a second) for the animation. If it's set to 0, it will animate once to fit the duration of the particle.D7: If > 1, it will randomize particle GFX from a pool of a desired length. Tiles should all go in sequential order with the full animation set up for each option. If < 0, this sets the item dropset for the combo (Misc Data->Item Drop Sets).\nGlobal Script Setup:\nCombine the example global script with your own. Then find this part in the script (you can Ctrl+F for \"//AUTO SLASHABLES HERE\"):\n\n\t\t//AUTO SLASHABLES HERE\n\t\t//Add your auto slashables with the provided function here\n\t\t//                                                         COMBO   SFX     TYPE    GFX     CS      FRAMES  ASPEED  RAND/DROPSET\n\t\t//EXAMPLE: \n\t\t//CSA_AddAutoSlashable(autoSlashableID, autoSlashableData, 7680,   41,     2,      52020,  2,      0,      0,      0); //Bush - Green\n\t\t\n\t\t\n\t\t\n\t\t//End of auto slashables\n\n\nExample setup from the test quest \n\n        //Add your auto slashables with the provided function here\n        //                                                       COMBO   SFX     TYPE    GFX     CS      FRAMES  ASPEED  RAND/DROPSET\n        CSA_AddAutoSlashable(autoSlashableID, autoSlashableData, 7680,   41,     2,      52020,  2,      0,      0,      0); //Bush - Green\n        CSA_AddAutoSlashable(autoSlashableID, autoSlashableData, 7682,   41,     2,      52020,  7,      0,      0,      0); //Bush - Blue\n        CSA_AddAutoSlashable(autoSlashableID, autoSlashableData, 7684,   41,     2,      52020,  8,      0,      0,      0); //Bush - Red\n        CSA_AddAutoSlashable(autoSlashableID, autoSlashableData, 7686,   41,     2,      52040,  7,      0,      0,      0); //Bush - Other Green\n        CSA_AddAutoSlashable(autoSlashableID, autoSlashableData, 7688,   21,     1,      88,     0,      0,      0,      0); //Toadstool\n        CSA_AddAutoSlashable(autoSlashableID, autoSlashableData, 1736,   65,     3,      52060,  2,      0,      0,      4); //Pot\n        CSA_AddAutoSlashable(autoSlashableID, autoSlashableData, 7690,   1,      4,      52080,  2,      0,      0,      4); //Dirt\n        CSA_AddAutoSlashable(autoSlashableID, autoSlashableData, 52,     41,     2,      52020,  2,      0,      0,      -13); //Bomb Shrub\n\n\nCopy the example function below and change the numbers to match what you'd put on an FFC for its respective arguments. You can have one of these for each unique slashable combo for up to 256 of them. This is a very experimental thing so I can't guarantee it will work perfectly and without any performance drops when a lot of them area added. For less common slashables you may still want to place the FFCs manually.\n\nRequires std.zh and ffcscript.zh.",
  "has_zip": true,
  "has_popup": true
}