{
  "name": "Simple improved candle script",
  "author": "Mitsukara",
  "added": null,
  "updated": "01 May 2014",
  "tags": [
    "#Item"
  ],
  "rating": null,
  "downloads": "48",
  "info": "This is a very small item script that lets you make a better version of the candle weapon (for a level 3 candle upgrade, or similar idea), without needing to use any global scripts.",
  "description": "This is a very small item script that lets you make a better version of the candle weapon (for a level 3 candle upgrade, or similar idea), without needing to use any global scripts. It shoots three flames in a straight line from where Link faces (similar to the regular candles), and they travel farther than the normal red and blue candle's flames (see the setup for how to adjust that).\n\nAlso, if the player taps the button quickly, additional flames can be fired to create a lot of fire at once (which gets pretty dangerous unless the rule \"Link isn't hurt by own fire weapons\" is checked... but that's up to the quest designer.).\n\nThis script can be attached a candle class item or a custom item class item and will still have mostly the same effects, but I recommend a candle item. If you want to, you could also attach it to a sword or wand or some other type of item, and they would shoots flames the same way (in addition to whatever they normally do).\n\nIf you put it on a custom item class item instead of an existing item class, you may want to add the line\n\nLink->Action = LA_ATTACKING;right before \"//The first flame\", so that Link will animate like he's using an item. That's optional, however.\n\nIf you do just use a candle-type item, however, it should also be noted that the regular built-in candle supports animations for stabbing and slashing (but the latter is only if you check 'slash' on the properties, and if Link learns the slash in your quest), so you could use that to show Link shooting the fires with a weapon animation if you're so inclined. The example quest demonstrates this feature. This makes candles handy for things like a wand, flamethrower, seed shooter, a poor person's pseudo-Cane of Somaria, etc.",
  "setup": "(the basic stuff, for new scripters:)\nSave the above code as a script (\"shootbetterfire.z\") with notepad or a similar text program. Then, on your script buffer, type\nimport \"shootbetterfire.z\"\n(or whatever you named your script file). As always, make sure to keep the line \"import std.zh\" at the top of your buffer. Next, hit compile, and if it says success, add it to your item scripts. Then, make a custom candle item (or whatever class of item you want to use; you could also attach it to an existing one, like Candle 2 (Red)). Go to the item's scripts tab and select shootbetterfire.z for the Action script.\n\n(the specifics for this script:)\nUnder the item's scripts tab, input these numbers:\n\nD0 - The weapon sprite to use for the fires; ZC's default flame sprite is 12.\nD1 - Speed of first flame; I recommend 150.\nD2 - Speed of second flame; I recommend 60.\nD3 - Speed of third flame; I recommend 120.\nD4 - How much damage the flames do.\nD5 - What sound the item makes while used; ZC's default fire sound is 13.\n\nNote: The speed of D1, D2, and D3 affect not only how fast the flames travel, but how far they go. Make them go faster and they'll shoot farther, or slower for not so far. The default candle fire speed for the built in Blue and Red candles seems to be 40; adding increments of 50 move it ahead by about 16 pixels or so.",
  "has_zip": true,
  "has_popup": true
}