{
  "name": "Combined Bow, Arrow, and Quiver Pick-Up",
  "author": "Timelord",
  "added": null,
  "updated": "09 Jul 2015",
  "tags": [
    "#Item"
  ],
  "rating": null,
  "downloads": "50",
  "info": "Tired of placing the bow, the arrow item, arrow ammo, and quivers as individual items? Why not make them a package (as in Z3)! That's what this script does for you.",
  "description": "Attach this script to a bow, as its Pick-Up script, and when Link gains the bow, he also gains a specified quiver, specific arrows (by type), a number of arrows (or rupees, if not using the 'True Arrows' quest rule). The script will also play a sound, create a hold-up animation, and display a message.\n\nAll of the following are configurable with arguments:The quiver to award (if any).The arrow item to award (if any).The number of arrows to award (if any).The sound to play (if any).The message to display (if any).The Hold-Up-Item animation to use (if any).\nYou may enable any, or all of these features at your discretion. The script automatically increases the arrows MCounter (maximum) based on the value assigned as the 'increase Counter Max' entry in the item editor properties for the quiver you choose to give (if any). if this value is lower than the present max arrows, the higher of the two values is always used.\n\nThe script uses intelligent boolean control, so that it only awards what you desire to award. You may award a bow, and a quiver, but no arrow item, or if you gave the player a quiver in init data, you may award only the bow, and an arrow type, or any combination of the options above.\n\nThe example quest demonstrates awarding a small quiver, and wooden arrows with the shortbow; and on the next screen, awarding the longbow, with a medium quiver, and silver arrows.\n\nPlease see the example quest, and documentation in the package.\nThe longbow, in the example quest (on screen 01), is packaged with the silver arrows. These silver arrows are cheaply set-up to use rupees in addition to arrows, just as a demonstration of using a negative value for arg D0 for quests with 'True Arrows' disabled.",
  "setup": "If you are not using any other scripts, uncomment the first line: ' import \"std.zh\" '.Add the script to your ZC buffer, or use an import directive to add it.Compile, and assign the item script BowPickup to an item script slot.If desired, create a string to display for this pick-up in Quest->Strings.If desired, add a custom sound for this pick-up in Quest->Audio->SFX DataGo to the item editor, and select a bow, then open it in the editor.Attach the script 'BowPickup' to the item's Pick-Up slot on the 'Scripts' tab.While still in the item editor, note the item numbers for the arrow type (e.g. silver), the quiver item, and the item number of the bow itself. A series of default values are listed in the script comments for easy access.\nScript Arguments\nWhile on the 'Scripts' tab of the bow item attributes pages of the Item Editor...Set up the arguments (D0, D1, D2, D3, D4, D5, and D6) as follows:\nD0: A number of starting arrows to give the player with the bow.Setting this to '0' will award no arrows.Setting it to a positive value (1 or more), will award arrows equal to the number.Setting it to a NEGATIVE number ( e.g. -20) will award a value in rupees equal to that number, if it was positive (e.g. -20 gives 20 rupees). This is for legacy style games that use rupees as ammo.\nD1: The Quiver to give the player, if desired.If you wish to award a quiver, enter the item number for it here.If you are not using the 'True Arrows' quest rule, you do not need to award a quiver.Note: You may leave this blank ( 0 ), when not using 'True Arrows'. Otherwise, leave it blank only if you either do not wish to award a quiver, or if the player already has one. Without a quiver, no arrows will be awarded, and the player will be unable to pick up arrow ammo drops, or use the arrow item.\nD2: The type of arrow to award:If the player already has an arrow type, and you do not wish to upgrade it, you may leave this blank ( 0 ).Otherwise, add the item number of the arrow type that you wish to award here.\nD3: The sound effect to play when the player is given the item bundle.The standard 'Special Item' sound in ZC is '20'.If you leave this blank ( 0 ), it will not play a sound.\nD4: The message string (from Quest->Strings) ID number to display when awarding the player a bundle.If you do not wish to display a string, set this value to '0'.Otherwise, assign the value of the String ID that you wish to display.\nD5: Set to a value of '1' or higher, to cause Link to hold the item over his head.\n\n\n\nValues:\n0: Do not hold above head.\n1: Holds with one hand.\n2: holds with two hands.\n3: Holds with one hand, as a Dive (water) secret\n4: Holds with two hands, as a Dive (water) secret.\n\nD6: If you are causing the player to hold the item overhead, set this to the item ID number of the bow that you are awarding. You can actually specify any item number here, and Link will hold that overhead. If you, as an example, want to make a special item that has the bow, and arrow together (not matching what you place on your subscreen), you can call the ID of that here.\n\nPlease see the values in the example quest if you need a reference. \nThe distributed package includes a text file with a copy of these set-up instructions. \nRequires: std.zh",
  "has_zip": true,
  "has_popup": true
}