{
  "name": "Stack Push Blocks EX 2.5",
  "author": "Alucard648",
  "added": null,
  "updated": "03 May 2022",
  "tags": [
    "#FFC",
    "#Item"
  ],
  "rating": "1",
  "downloads": "26",
  "info": "Another FFC pushblock script pack that encompasses variety of common pushblock puzzles, including StackPushing and many more.Written and tested in ZC 2.53.1 beta 55.Credits: Colossal, klop422. Update done on request by Skyflare",
  "description": "I always find L3 Bracelet item being quite boring upgrade that does nothing but allow pushing different looking blocks. I came with Idea of breaking, at controllable degree, one of fundamental rules of Sokoban - only one block can be pushed at time.\nThe rest of the features are all come from 100 rooms of Wisdom and inspired by other quests.Ice push blocks.Floor painting puzzles.Colored blocks and triggers.Remote controlled pushblock puzzlesAnd some more...\nUpdate 2.1.2022\n- Fixed stackpushing of iceblocks\n- Ice blocks can now get stuck if landed on triggers. Set D0 to 1 in FFC with\nAutomaticFreeformPushblockPuzzle script to avoid that.\n- Added new FFC script - Remote controlled Pushblocks. Stand on FFC, face the chosen direction and press EX1 to push all pushblocks\nUpdate 11.03.2022\n-If painting iceblock FFC and floor that needs to be painted match CSets, floor combo, instead, will change to next one in the list.\n-Added iceblock painting sound.\n-New FFC script: Icy Hamiltonian Puzle, Straight from Machinaruim. Place an iceblock in puzzle area, then use remote controller FFC to make it paint all space, replacing painted area with solid combos.\nUpdate12.03.2022\n-Added new puzzle type - Pushblocks change to next combo in the list after every push.\nUpdate 30.13.2022\n-No longer uses Misc variables.\n-Fixed bug that caused bracelet items to be unused, if ID exceeds 143.\n-UpdateFreeformBlockPower item pickup script is become redundant, as GetPraceletPower function was rewritten to increase perfomance.\nUpdate 3.5.2022 \n-New bonus script - Match 2 puzzle - If two or more pushblocks with the same combo ID and CSet collide, they disappear. Remove all pushblocks to solve the puzzle.\n-New flag for pushblocks - always leave undercombos behind, like ZC engine pushables.\nKnown issues:Link cannot StackPush mixes of normal and ice blocks.Only placed push flags must be used when building puzzles to prevent in-engine block pushing functionality to interfere with script.No support for sideview screens - blocks float in mid-air.",
  "setup": "1. Check out the constants at the top of script file, especially FFC_MISC_* to avoid conflicts with other FFC scripts.2. import and compile the script. Assign 4 FFC scripts and 1 Item script. No extra libraries beyond default ones.3. Set IC_MULTIPUSHBLOCK item class items Power to total stack wight limit Link can push ( normal - 0, heavy - 1, very heavy - 2).4. if you have bracelet placed or hidden on the same screen as scripted push blocks, assign UpdateFreeformBlockPower script to bracelet`s onPickup item script slot. As of v2.4, this step can be skipped.5. Construct block puzzle as if you did it in ZC 2.53- versions, but use only placed push flags.- Flag Ice PushBlocks with CF_FFICEBLOCK flags (default is #98)- The only inherent flag that works is CIF_STACKPUSH_ONLY(default is #99) that restricts blocks to StackPush only. These blocks cannot be pushed directly, only in stack with other blocks.- Make sure there is enough FFC`s to run the puzzle. Each block is separate FFC + 1 used for handling triggers.- Block holes (flag#91) change combo to the next one in the list, not to the combo next to combo of block dropped into the hole.6 Place invisible FFC script anywhere on the screen, assign AutomaticFreeformPushblockPuzzle into it`s script slot. - D0 - Allow blocks to be pushed off triggers, like in classic Sokoban. - D1 - Remove all blocks and clean up FFC`s when puzzle is solved. - D2 - Special Puzzle mode - 1.Ice Push blocks paint floor into his own Cset. If all combos flagged with CF_BLOCKTRIGGER are painted, secrets pop open. - 2.Colored blocks and block triggers. Each block trigger must be covered by block with matching CSet to solve the puzzle. If D0 is set to 0, blocks can get stuck on mismatching triggers, failing the puzzle. - 3. Pushblocks change to next combo in the list after every push. -  D3 - 1 - Always leave udercombos behind7. Test, enjoy, report bugs...Remote controlled pushblocks - Place FFC at control panel location. No arguments needed.Icy Hamiltonian puzzle:1. Set up 2 consecutive combos. 1 for puzzle space and 1 solid combo for replacement2. Build puzzle area using 1st combo from step 1. Flag all those combos with BlockTrigger flags.3. Set screen`s under combo to second combo from step 2.4. Place FFC with PlaceableIceblock script anywhere in the screen.D0 - ID of Iceblock comboD1 - CSet of Iceblock comboD2 - sound to play on placementMatch 2 puzzle: Place anywhere in the screen. No arguments needed.You may also open unpassworded demo quest to see, how various puzzles are technically set up.",
  "has_zip": true,
  "has_popup": true
}