{
  "name": "Gasha Trees",
  "author": "Mani Kanina",
  "added": null,
  "updated": "14 Jul 2020",
  "tags": [
    "#FFC",
    "#Item"
  ],
  "rating": null,
  "downloads": "16",
  "info": "A recreation of the Gasha Trees from the Oracle titles.",
  "description": "A recreation of the Gasha Trees from the Oracle titles.\nAlso known by the names: Gacha Trees, Loot box trees, Where the fuck is my green ring trees?!?!\n\nFuture versions might make more things configurable as well as making the animation smoother. Bug fixes pending when found.\n\nUpdate 1:\n\nSpoiler \n- Fixed a bug that caused the tree to not properly used the config cset.\n- Added support for custom drop pools defined in the FFC\n\n\nSimilar to the Oracle trees:\nThe script does support having a Gasha Ring items (like the Oracle games) that makes the trees grow twice as fast. It's by default not configured, but you can plug in whatever item ID you wish in the script file config section, and if Link has it then the trees will grow at twice the rate.\nSword is needed to cut down nuts. (I don't think anything else works in those games?)\n\nDifferences:\nThe growth rate of the trees to reward tiers is probably not accurate since I could not find good data on it online.\nSimilarly, the items in the reward pools also don't match the oracle games super well since I could not find good numbers, and ZC don't have even close to the insane number of rings as those games did.\nSupports up to 97 unique trees in a given quest (the oracle games each had 16).\nThe RNG for the Nut is rolled when the seed is planted, not when the nut is harvested. (RIP save scumming :^) )\nInspecting dialogue and interface is somewhat different. (If you config the script file, you can call a ZQ string when you inspect a soil, this will happen regardless of if you have seeds, the planting option follows and only plays if you have more than 0 seeds).\n\nTree Growth rate:\n(Did you know that the Gasha trees in the oracle games grow based on enemies killed?)\n\n0-40 kills: Sapling state.\n40-60 kills: Grown tree.\n60-90 kills: Low reward tier nut.\n90-120 kills: Medium reward tier nut.\n>120 kills: High reward tier nut.\n\nThe reward tiers by default are like this:\n(If you have already gotten a piece of heart from the trees, you can't get it again, you can tweak the config values in the script file to adjust how many pieces of hearts you can get)\n\nLow rewards:\n20 rupee: ~10%\n10 rupee: ~40%\nFairy: ~15%\nRecovery heart: ~35%\n\nMedium rewards:\n50 rupee: ~10%\n20 rupee: ~85%\nFairy: ~5%\n\nHigh rewards:\nPool 1:\nCharge Ring: 45%\nMagic Ring (L1): 45%\n100 rupee: ~10%\n\nPool 2:\nPeril Ring: ~45%\nWhisp Ring: ~45%\n100 rupee: ~10%\n\nPool 3:\nHeart Ring (L1): ~45%\nWhimsical Ring: ~45%\n100 rupee: ~10%\n\nPool 4 (With PoH):\nPiece of Heart: ~25%\nMagic Ring (L1): ~15%\nWhisp Ring: ~30%\nWhimsical Ring: ~30%\n\nPool 4 (Without PoH):\nMagic Ring (L1): ~40%\nWhisp Ring: ~30%\nWhimsical Ring: ~30%\n\nCustom High rewards (if enabled):\nFFC D6 item ID: ~40%\nFFC D7 item ID: ~40%\nFFC D1 item ID: ~20%\n\nBad behaviour:\nHaving multiple trees per screen should be plausible, but it's recommended that only zero to one of them are of the reward pool 4. Because otherwise you could exceed the defined piece of heart gain.\nIf you want multiple trees per screen, make sure the quest rule->NES Fixes->Items Disappear During Hold-up is the properly toggled, otherwise the quest will lock up when harvesting on screens with more than one nut.",
  "setup": "The script requires you to include/import std.zh in your main script file.\nMain Configuration steps:\n1. Set up Global active script\nPut: GB_Gasha_EnemyDying();\nIn your global active script, this script will not do much without the enemy killed tracker.\n\n2. Place and configure your FFCs\nFor proper set-up, FFCs running the script should be:\n1. A invisible combo or have the \"only see with lens\" FFC flag toggle on.\n2. Have the flag for \"Run Script at Screen Init\" turned on.\n3. The script loaded in the script slot.\n\nThe FFCs D value pointers are as follow:\nD0: Tree Index (Give each tree you want to place a unique number between 0 and 97)\nD1: Reward pool that highest tier fruits pull from. 1 through 4 are valid numbers (see further info for pool contents). (Values less than 1 default to 1 and values higher than 4 defaults to 4)\nD2: The screen index of the FFC running the script. (Should be viewable in the title bar of the FFC you're editing).\nD3: The combo ID of a combo that is the combo type: \"Screen Freeze (Except FFCs)\"\nD4: The combo ID of the first combo in a row of 6 that makes up the tree and misc, the combos are as follow: (1) Top left tree part, (2) Top right tree part (3) Planted sapling (4) The gasha nut (5) bottom left tree part (6) bottom right tree part\nD5: The direction the tree will grow in, values 0-3 are valid. (0: up left, 1: up right, 2: down left, 3: down right)\nand, if you want to use a Custom High rewards pool instead of the hardcoded ones (if not, leave D6 and D7 as 0):\n\nD6: item ID for reward 1 (40% chance)\nD7: item ID for reward 2 (40% chance)\nD1: item ID for reward 3 (20% chance) (Yes D1 is re-purposed for this if you set D6 and D7)\n\nCreate the Gasha Seed Item:\nSimply use the item editor to make an item that increase the Script 5 counter reference by 1 (or however many you want) when you pick it up. You can also use this counter reference on the HUD or pause screen if you wish to let the player keep track of how many seeds they have to plant.\n\nAdvanced Configuration steps:\nThe script file includes a ton of customizable variables at the top of it, they all have proper descriptions so they should be self evident what they do. But if you wish to tweak reward pool or similar, this is where you need to look.",
  "has_zip": true,
  "has_popup": true
}