{
  "name": "Matrix Password Puzzle",
  "author": "Alucard648",
  "added": "11 Aug 2021",
  "updated": null,
  "tags": [
    "#FFC"
  ],
  "rating": "1",
  "downloads": "8",
  "info": "A superior variant for Password puzzle script that allows creating 2 dimensional combination lock puzzles and some more functions. Used in 100 Rooms of Wisdom. Written and tested in 2.53.1 beta 55.",
  "description": "This puzzle, unlike my old one can create 2-dimension matrix code puzzle. Link must input combination code by changing combos in any way to trigger permanent secrets. If certain option is set On, Link can input password by standing on combos and pressind A. Additionally, if quest designer allows it, Link can crack the password lock with Lens of Truth. Various  puzzle ideas are included in example quest.",
  "setup": "1. Check out constants.MATRIX_PUZZLE_ALLOW_INPUT_WITH_A_BUTTON = 1; //Set to anything > 0 to allow Link to input password by standing on combos and pressing A.CF_MATRIX_PUZZLE_SKIP_COMBO = 67;//Combo flag to be places on combos that are not a part of a puzzle.SFX_MATRIX_PUZZLE_COMBO_CHANGE = 16; //Sound to play, when changing password combos by standing on combos and pressing A.SFX_MATRIX_PUZZLE_SOLVED = 27; //Sound to play, when correct password is inputed.CF_MATRIX_PUZZLE_LENS_VIS = 14; //Combo flag, which, if placed onto password combos, allows Link to crack the code with Lens of Truth.CF_NO_AUTO_INPUT = 98; //Flag puzzle with this to prevent Link to input password by standing on combos and pressing A on per-puzzle basis.2. Set up set of consecutive combos for password alphabet (Letters A-Z, colors for color puzzle etc.), followed by combo that looks like first combo in sequence and immediately cycles to it.3. Import and compile the script. No extra dependencies beyond default ones.4. build rectancular puzzle in solved state, using combos you set up in step 2. Flag unused spaces in rectangle area with CF_MATRIX_PUZZLE_SKIP_COMBO5. if you want to allow Lens of Truth to crack the code, flag combos of puzzle with CF_MATRIX_PUZZLE_LENS_VIS.6. Place invisible FFC in top left corner of the puzzle area. 7. Make sure that Run Script at Screen Init FFC flag is set on.8. Assign scrip to slot. D0 - ID of first combo sequence from step 2. D1 - Width of matrix password puzzle, in combos. D2 - Height of matrix password puzzle, in combos.9. Test and enjoy.Check out example quest st see how puzzles are set up.",
  "has_zip": true,
  "has_popup": true
}