{
  "name": "Boss Health Bar",
  "author": "Moosh",
  "added": "03 Feb 2018",
  "updated": null,
  "tags": [
    "#FFC"
  ],
  "rating": "7",
  "downloads": "65",
  "info": "Four FFC scripts for two types of health bars.",
  "description": "Both types of health bars come in two scripts: one for single enemies and one for keeping track of health for a group of enemies. The first is a lot simpler only requiring some color constants be set to use. The second uses tiles and is a little more work to set up.\n\nFeatures include:Boss names, either grabbed from the enemy or from a ZQuest string.Damage trackingDraining animations for each hitVertical health bars like in Mega Man (these use the tiled version and are a bit weird to set up)\n\nUpdate 6/29/20: Fixed a compatibility bug with ghost.zh that caused enemies to have 1 HP remaining during death animations.",
  "setup": "There's a couple setting constants that can toggle features on the health bar off if you don't want them. These are:HEALTHBAR_DRAW_DAMAGE: Set to 0 to disable damage tracking.HEALTHBAR_DRAW_CHIP: Set to 0 to disable smooth draining animations as you take off health.\nThere's also a lot of nonessential constants that I won't cover here for the sake of keeping setup simple, but you can read the comments and get a general idea what they do.\n\nNon-Tiled Health Bars:\nConstants:\nThese scripts have a lot of nonessential constants you can tweak. I'll only list off the most important ones here:C_HEALTHBAR_FONT: Color of the names and damage tracking numbers drawn above the health bars. Color constants have an 0x in front of them to indicate to the script that they're hexadecimal. The first digit afterwards (0-F) is the CSet and the second is the color.C_HEALTHBAR_FONTBG: Color of the outline for the font.C_HEALTHBAR_OUTLINE: Color for the outline of the health barC_HEALTHBAR_BAR: Color of the health barC_HEALTHBAR_DRAIN: Color of the draining portion of the health barC_HEALTHBAR_BG: Color of the background of the health bar\nHealthBar_Single:\nThis health bar is used for single enemies or multiple enemies where each has their own unique health bars. The arguments go as follows:D0: The enemy ID of the enemy on the screen to attach the health bar to.D1: Which ZQuest string to use for the enemy's title. If 0, will use the enemy's editor name. If you don't want a name, you can set this to a blank string.D2: If multiple enemies of the same ID are using the health bar script, this argument specifies which one of them to attach the health bar to.D3: Set to 1 if you want the health bar to disappear shortly after the enemy dies. Otherwise, set it to 0 and it will hang around until you leave the screen.\nHealthBar_Group:\nThis health bar is used for groups of enemies that you want to share a single health pool for their health bar. It supports up to 6 different enemies in the pool, and allows for duplicates of the same enemy. The arguments go as follows:D0-D5: The enemy IDs of the enemies to use to calculate health.D6: Which ZQuest string to use for the enemy's title.D7: Set to 1 if you want the health bar to disappear shortly after the enemy dies. Otherwise, set it to 0 and it will hang around until you leave the screen.\nTiled Health Bars:\nConstants:\nThis one uses a lot more constants, and may be a bit more trial and error to use if you're not familiar with ZC's screen space:\n\nFont Colors:C_HEALTHBAR_TILED_FONT: Color of the names and damage tracking numbers drawn above the health bars. Color constants have an 0x in front of them to indicate to the script that they're hexadecimal. The first digit afterwards (0-F) is the CSet and the second is the color.C_HEALTHBAR_TILED_FONTBG: Color of the outline for the font.\nSettings:HEALTHBAR_TILED_UNIQUEFIRSTLAST: Set to 1 if you want the health bar to use unique tile blocks for the first and last tile.HEALTHBAR_TILED_DRAWCAPS: Set to 1 if you want the health bar to draw cap tiles on either ends (these only have two states, full and empty and are mainly used in place of unique first and last for health bars where you want fancy end decorations.HEALTHBAR_TILED_VERTICAL: Set to 1 if you want the health bar to go vertically. This will disable name labels and damage tracking numbers.\nPositioning/Shape:HEALTHBAR_TILED_X/HEALTHBAR_TILED_Y: X and Y position of the starting block. Remember that Y goes down instead of up in ZC.HEALTHBAR_TILED_NUM_BLOCKS: The number of tile blocks making up the health bar.HEALTHBAR_TILED_SPACING: The spacing between tile blocks. This can be negative to make your bar go backwards from the starting block, which you'll probably want to do for vertical bars. It can also be smaller if want for example a health bar made of 8x8 pixel blocks.HEALTHBAR_TILED_STATES: How many possible states each tile block can have. 17 would be exactly one state for every pixel of the tile across, including fully empty.\nGraphics:CS_HEALTHBAR_TILED: The CSet the health bar is drawn in. Doesn't matter if yours is 8-bit like mine.\nNow we have a whole bunch of constants specifying the first tile of every group of tiles. Depending on your setting constants you can ignore some of these. All sets of tiles go from a full health bar block to an empty one. See the included image for examples of how it should look.\n\nFirst the main health bar:TIL_HEALTHBAR_TILED_MAIN: The tile for the main tile block. Most of them will use this.TIL_HEALTHBAR_TILED_FIRST: The tile for the starting tile block.TIL_HEALTHBAR_TILED_LAST: The tile for the ending tile block.TIL_HEALTHBAR_TILED_FIRSTCAP: The tile for the start cap. (First of two tiles, one with the bar filled, one empty)TIL_HEALTHBAR_TILED_LASTCAP: The tile for the end cap.\nThen you repeat for the drain health bar:TIL_HEALTHBAR_TILED_DRAIN_MAIN: The tile for the main tile block. Most of them will use this.TIL_HEALTHBAR_TILED_DRAIN_FIRST: The tile for the starting tile block.TIL_HEALTHBAR_TILED_DRAIN_LAST: The tile for the ending tile block.TIL_HEALTHBAR_TILED_DRAIN_FIRSTCAP: The tile for the start cap. (First of two tiles, one with the bar filled, one empty)TIL_HEALTHBAR_TILED_DRAIN_LASTCAP: The tile for the end cap.\nThe drain health bar will be drawn behind the main one, allowing for the smooth drain animation. If you don't have that enabled, you can ignore it entirely as it won't be drawn.\n\nThe arguments for the tiled health bars are the same as the normal ones, but I'll list them again for convenience.\n\nHealthBar_Tiled_Single:\nThis health bar is used for single enemies or multiple enemies where each has their own unique health bars. The arguments go as follows:\nD0: The enemy ID of the enemy on the screen to attach the health bar to.\nD1: Which ZQuest string to use for the enemy's title. If 0, will use the enemy's editor name. If you don't want a name, you can set this to a blank string.\nD2: If multiple enemies of the same ID are using the health bar script, this argument specifies which one of them to attach the health bar to.\nD3: Set to 1 if you want the health bar to disappear shortly after the enemy dies. Otherwise, set it to 0 and it will hang around until you leave the screen.\n\nHealthBar_Tiled_Group:\nThis health bar is used for groups of enemies that you want to share a single health pool for their health bar. It supports up to 6 different enemies in the pool, and allows for duplicates of the same enemy. The arguments go as follows:\nD0-D5: The enemy IDs of the enemies to use to calculate health.\nD6: Which ZQuest string to use for the enemy's title.\nD7: Set to 1 if you want the health bar to disappear shortly after the enemy dies. Otherwise, set it to 0 and it will hang around until you leave the screen.\n\n\nThis script requires std.zh and (optional) ghost.zh. If you're not using ghost you can swap out the uncommented line in HealthBar_GetHP() function for the commented one below it.",
  "has_zip": true,
  "has_popup": true
}