{
  "name": "EmilyMisc.zh [2.55]",
  "author": "Emily",
  "added": null,
  "updated": "08 Jul 2021",
  "tags": [
    "#2.55",
    "#Library",
    "#Misc"
  ],
  "rating": null,
  "downloads": "36",
  "info": "A header of misc utility functions. Required by some of my scripts.",
  "description": "Functions:V1.0 (24-May-2019):RunNPCScript (and variants) - spawns an NPC, and sets it to have a given script/args (ala RunFFCScript style)Direction manipulations - get only the vertical/horizontal component, or spin in increments of 45°CanWalkM - A variation of CanWalk, that uses a mapdata pointer. This can handle solidity checks for any arbitrary screen, not just the current one.CurMapData() - returns a mapdata pointer to the current screenMooshDrawTile() - Credit Moosh - better rotated drawingV1.1 (23-Jun-2019):Inverse versions of VectorX/VectorY, which take an angle and a change in x/y, and give you the diagonal length (instead of taking the angle and length to give the change in x/y)Triangle-Rectangle, Triangle-Point, and Line-Rectangle collision functions.`ffcSolid(ffc f)`, a function which fakes FFC SolidityScroll checking functions, which can be used to check if the player is about to start scrolling, and if scrolling in a particular direction worksMy own versions of InFrontX and InFrontY, which work better`haltFFC`, which removes all movement from an ffc (i.e. it removes the Vx/Vy/Ax/Ay)V1.2 (03-Jul-2019)Renamed `InFrontX` and `InFrontY` to `InFrontCenteredX` and `InFrontCenteredY`, to remove std.zh conflict when `using namespace Emily;`, and to better describe what they do.V1.3 (22-Jul-2019)Modified the `CanWalkM` functions; removed some unneeded overloads, and added a full extra set `CanWalkMFull` for full collision (instead of just \"ahead of you\" collision)Added `DrawStrings()` and `DrawStringsBitmap()`, which function as `Screen->DrawString()` and `bitmap->DrawString()` respectively, except that they can draw multiple lines, constrained to a specific width (similar to Tango textboxes, but, without needing Tango)(The drawstrings functions require ZC 2.55 A28+)V1.4 (08-Jul-2021)Added a few functions, including versions of the DrawStrings functions that include the shadow option.",
  "setup": "Just drop in in your `include` folder, or the root ZC dir. Any of my scripts which require it will import it themselves.",
  "has_zip": true,
  "has_popup": false
}