{
  "name": "Z3-esque Keys (and Item Pickup)",
  "author": "Timelord",
  "added": "11 May 2014",
  "updated": null,
  "tags": [
    "#FFC",
    "#Global"
  ],
  "rating": null,
  "downloads": "26",
  "info": "Pick up keys, or qustmaker-specified items using the booerang, hookshot (or any two specified items per FFC), without enabling 'Z3 Boomerang/Hookshot' in Quest Rules.\n\nNote: RPG.zh/RPG_Items.zlib (see my signature) has global functions ( BrangKey() and others) that do this without needing FFCs. Please use those instead.",
  "description": "Notice: This first section of this script, is a set of global functions, useful for handling item interaction with FFCs. If you are already using these functions, then you will only need the FFC section of this script.\nZ3-esque Keys & Items, is an FFC script, that allows you to set a specific item on a screen, that the player may obtain through one of two items: The item given, and the items that can retrieve it are set in script arguments.\n\nThe base function of this, is to allow the player to pick up keys, using items such as the boomerang, or the hookshot, to solve puzzles, without enabling the 'Z3 Boomerang/Hookshot' Quest Rule, which allows the player to pick up any Screen->Item with the boomerang, and hookshot class items.\n\nWhen using it, you will need to set a few arguments, to assign the items that can pick up the FFC Key, or you may hared-code the value into the script, if your quest will never use items other than these two, for item collection. You may also expand this, to allow any number of items to collect the FFC-generated item, should you want a wider variety, but the base script assumes that you will set one, or two items, in script arguments.\n\nThe default item generated by this script is a normal key. You may change this to a level-specific key, by setting the value of one argument, and you may further give other items, by further argument settings.\n\nEssentially, you can give any item in your game, and allow any two items to collect it, but the player will not be able to pick up the item merely by touching it.\n\nThis script is intended for placing items in out-of-reach places, and requiring clever item usage to collect them.",
  "setup": "If You Have an Existing Script Set\nAdd the global constants, global variables, and global functions to your existing script.Add the FFC script to your existing scripts.Place the global functions in your main active while loop, before Waitdraw().Compile.Assign the FFC script 'Z3_Key_Pickup' into an FFC Script slot.\nIf You Do Not Have an Existing Script Set\nImport this file as your main script, and compile it. (It is a self-contained, and complete set-up.)Assign the FFC script 'Z3_Key_Pickup' into an FFC Script slot.Assign the included Global Active script to your Global Active Script Slot (2).\nUsage\nAdd the combo used for the item that you want the player to obtain, to your combo pages.Create an FFC, and set the combo for the item to it, as you wish the player to see it.Enable the script 'Z3_Key_Pickup' to the FFC as its active script.Enable the FFC Flag: 'Run Script on Screen init'\nSet the Arguments as Follows\n\nD0: Set to the Item Class of the primary item that you want to be able to pick up the item generated by the FFC, using the numeric values from std_constants.zh. (Using specific items is planned for a later update.) The default value for the boomerang, is '1'.\n\nD1: Set to the Item Class of the secondary item that you want to be able to pick up the item generated by the FFC, using the numeric values from std_constants.zh. (Using specific items is planned for a later update.) The default value for the hookshot is '21'.\nNote: If you do not wish to use a secondary item, set this to '0'.\n\nD2: If you wish to give the player a normal key, leave this at '0'.\nIf you want to give the player a level-specific key, set this to a value of '1'.\n\nIf you want to give the player a specific item, set this to a negative number, equal to the item editor number.\n\n(Thus, for the blue ring, item 17, you would enter '-17' as the value of this argument.\n\nD3: Set this to the audio/SFX Data value to play when picking u the item.\nThe Default value for 'Item Pickup' is 22.\n\nYou're done!. Position the FFC on the screen, as you desire.\n\nNote: This is tested for one instance per screen, and secondary instances per screen may not work. I may allow for additional instances, in a future update.\n\nAll argument information is also contained in the script file, which is commented so that you may more easily follow its operation.",
  "has_zip": true,
  "has_popup": true
}