{
  "name": "Pushable Pillars",
  "author": "Mr. Z",
  "added": "30 Apr 2014",
  "updated": null,
  "tags": [
    "#FFC"
  ],
  "rating": null,
  "downloads": "43",
  "info": "This lets you make wide pushable blocks up to 4 combos big, such as seen in the Gameboy games (see screenshot)\nThe push distance can be adjusted, so these can be used as ice blocks as well, although they'll be either vertical or horizontal.",
  "description": "This script is an edit of Colossal's Ice Push Block script.\n\nIt lets you make wide pushable blocks up to 4 combos big, such as seen in the Gameboy games (see screenshot)\nThe push distance can be adjusted, so these can be used as ice blocks as well, although they'll be either vertical or horizontal.\n\nThese blocks stop when they hit a solid combo or a no-push flag. They'll move over any combo that is not solid, including water and pits.",
  "setup": "It requires some setup:\n\n-First: Import the script to any ffc slot you want.\n\n-Second: Go to Tiles and make two 4 by 4 grids of the tile you want to push. Like this:\nFor the horizontal pillars:\n==== 1\n==== 2\n==== 3\n==== 4\n\nAnd for the vertical pillars do it like this:\n| | | |\n| | | |\n| | | |\n| | | |\n1,2,3,4\nThese numbers are the frames of the graphic as it's standing still (1) or is being pushed (2-4). You need to make all these tiles even if you're not using an animation.\n\n-Third: Turn each tile into a SOLID combo using the same 4 by 4 pattern as the tiles.\n\n-Fourth: Place a FFC on the grid. Use the top-left combo of the graphic you want to push around. Then attach the script.\n\n-Fifth: Now adjust the size.\nSet ComboW to 16, 32, 48 or 64 if you're using a horizontal pillar. Use ComboH for vertical pillars.\nSet TileH or TileW to 1, 2, 3 or 4 (a 16th of the Combo-W/H)\n\n-Sixth: You have to set 2 Arguments:\n*Set D0 to 1 if you're using a vertical pillar, or to 2 if the pillar is horizontal.\n*D1 is the amount of tiles the pillar will move when pushed, can be as big as you want, although more than 16 would be pointless. Use at least 1, or the pillar won't move.\n\n-Seventh: Layer 1 is used as the under combo, so any tiles that the pillars may cross over have to be drawn on layer 1. (Just copy the whole screen)\n\nThere is 1 constant integer, PILLAR_SENSITIVITY, which is the amount of frames you have to push the block before it starts moving.\n\n\nResources\n\nstd.zh as usual.",
  "has_zip": true,
  "has_popup": true
}