{
  "name": "Link & Enemy Damage and Healing Numbers",
  "author": "Moosh",
  "added": "18 Nov 2019",
  "updated": null,
  "tags": [
    "#Global"
  ],
  "rating": null,
  "downloads": null,
  "info": "A script that makes numbers appear over Link and enemies when they take damage or heal, like an RPG.",
  "description": "A script that makes numbers appear over Link and enemies when they take damage or heal, like an RPG. This was inspired by existing scripts such as Jamian's and should be a bit more customizable, but still has the same limitations with NES bosses being a bit janky.\n\nUpdate 11/19/19: I forgot to clear the numbers when the screen changes. This visual bug should now be fixed.\nUpdate 11/21/19: Added multipliers and decimal values, for those who don't want 1 heart of damage to equal 16 points.",
  "setup": "Combine the example global script with your own and set the following constants:NPCM_DAMAGENUMBERSLASTHP: An npc->Misc[] index (0-15, or 0-31 in 2.55) that's unused by any other scripts.\nDamage Number Digit Graphics:\nThese are sets of 11 tiles or combos each and CSets to draw them in, representing the numbered digits 0-9 and decimal point. GFX_ constants are the first of the 11 tiles or combos. If the constant is >0, it will use tiles for the graphics and if it's <0 it will use combos. If it's 0 then that type of damage number will be disabled. If you don't have your own tiles, I've included mine in the script's images. CS_ constants are the CSet the tiles are drawn in.GFX_DAMAGENUMBERS_ENEMYCS_DAMAGENUMBERS_ENEMYGFX_DAMAGENUMBERS_ENEMYHEALCS_DAMAGENUMBERS_ENEMYHEALGFX_DAMAGENUMBERS_LINKCS_DAMAGENUMBERS_LINKGFX_DAMAGENUMBERS_LINKHEALCS_DAMAGENUMBERS_LINKHEAL\nDAMAGENUMBERS_WIDTH and DAMAGENUMBERS_HEIGHT determine the size in pixels of the digits. They're expected to be monospaced, meaning each digit has the same width and height.\n\nDAMAGENUMBERS_ENEMY_MULTIPLIER and DAMAGENUMBERS_LINK_MULTIPLIER will multiply the damage amount shown. So with a multiplier of 0.0625, 16 points of damage will show up as 1.\n\nDAMAGENUMBERS_ENEMY_DECIMAL_PLACES and DAMAGENUMBERS_LINK_DECIMAL_PLACES will affect the number of decimal places that are always shown. If -1, it will show however many are needed, leaving off any trailing zeroes.\n\nOptional Constants:DAMAGENUMBERS_MAX: The maximum number of damage numbers that can be drawn to the screen at once.DAMAGENUMBERS_FRAMES: How many frames damage numbers persist forDAMAGENUMBERS_SPAWNFRAMES: How many frames the spawning animation of the numbers takes (0 for instant)DAMAGENUMBERS_XOFF: X offset for the spawn position of the numbersDAMAGENUMBERS_YOFF: Y offset for the spawn position of the numbersDAMAGENUMBERS_YSPEED: How fast the number moves on the Y axis in pixels per frame (negative is upwards on the screen)DAMAGENUMBERS_BOUNCEHEIGHT: How high the number bounces during its spawn in animation in pixels per frameDAMAGENUMBERS_LINKDAMAGECOOLDOWN: How many frames minimum between numbers for Link being hit appearing (in case you have scripts damaging him every frame)DAMAGENUMBERS_LINKHEALCOOLDOWN: How many frames minimum between numbers for Link being healed appearing (in case you have scripts healing him every frame)DAMAGENUMBERS_ALLOW_LARGE_NEGATIVE: If this is 1, enemies with -1000 HP can still show damage numbers. Generally this may cause buggy interaction with scripts but if you have really high player damage in your quest, go ahead.\nThis script only requires std.zh.",
  "has_zip": false,
  "has_popup": true
}